{"Job_ID":{"8":4120976805,"26":4144431991,"30":4120978886,"9":4132048865,"7":3935983004,"23":4143224517,"0":4137245989,"27":3787789000,"11":4139845618,"22":4144441725,"19":4142359405,"10":4121134848,"20":4144343176,"5":4133033481,"28":4042554544,"25":4144900760,"31":4142361143,"2":4063857099,"12":4082686855,"3":4122081493,"4":4121139946,"1":3936580453,"33":4142319103,"21":4145588902,"24":4143223837,"32":4072487387,"6":4139199423,"35":4130151238,"15":4072902328,"17":4144820138,"16":4144819234,"36":4142330252,"29":4144909903,"18":4144434105,"14":4131020637,"34":4142312846,"13":4129433849},"Job_txt":{"8":"Junior C++ Developer Luxoft Bulgaria Sofia, Sofia City, Bulgaria 4 weeks ago 29 applicants See who Luxoft Bulgaria has hired for this role Apply Save Report this job Direct message the job poster from Luxoft Bulgaria Dzhuliyana Yordanova Dzhuliyana Yordanova 💡 Empowering Careers | CV Whisperer | Job Search Strategist \/ 18K+ Network 💎 Project Description: Luxoft is one of the major Software Services companies worldwide. We deliver professional software services in multiple business verticals such as Finance, Automotive, and Digital Transformation. Luxoft is building up a new special purpose organization (SW House) targeted at developing In-Vehicle Infotainment (IVI) systems for the age of autonomously driving vehicles. How do people in cars spend their time? How do they interact with information and how do they best utilize the car's infrastructure in a future 2025? How to surpass all the benchmarks in automotive SW development. We believe that Software is the driving force to enable and differentiate in future environments. To achieve outstanding user experience, we build the SW House to apply the best of open source in the way that open source communities are meant to work, we focus on living continuous integration up to its most modern concepts including continuous delivery right into the vehicle. Our project setup and way of working follows agile principles scaled to a team of multiple hundred people. Combining the latest technologies, an agile way of working, and continuous striving for the best solution, we will define what IVI looks like in the future together with our OEM partner. Responsibilities: As a developer, you will develop features, design, document, implement, integrate, and test platform services. Development will typically have C++ focus, and make use of modern tools and methodologies. You will identify and solve problems that require analysis by adopting existing procedures, techniques, and methods. You will actively contribute to improvements and changes take responsibility for delivery, and encourage others to do the same. Furthermore, you have a good understanding of the group's joint tasks and are seen as a person who takes full responsibility and a person who work colleagues can trust. Stack: С++17, POSIX, Linux kernel, Linux kernel modules, IPC (DBus, gRPC, TCP\/IP), Boost, docker, Yocto, AppArmor Mandatory Skills: C++ Embedded C++ Linux Test Cases Testing Mandatory Skills Description: Embedded Linux (C++\/C++17) Programming skills Experience in embedded systems Familiar with design patterns and testing Experience with open-source-software, scripting, and CMake is a strong plus Experience with Linux (Yocto) Proficiency in problem-solving and troubleshooting technical issues Excellent organizational, time management, prioritization, and multi-tasking skills Ability to handle multiple competing priorities in a fast-paced environment Personal initiative, commitment, perseverance, and resilience Well-developed communication and teamwork skills Aspiration for engineering excellence Language skills: Proficient in English - B2 level Show more Show less Seniority level Associate Employment type Full-time Job function Information Technology Industries IT Services and IT Consulting Referrals increase your chances of interviewing at Luxoft Bulgaria by 2x See who you know","26":"Back End Developer, Algorithms\/Data Structures, GoLang | Crypto Exchange, Scale up | Salary Range $100,000-$130,000 Base + Stock Options + Benefits (Fully Remote) Owen Thomas | Pending B Corp™ European Union 16 hours ago 53 applicants See who Owen Thomas | Pending B Corp™ has hired for this role Apply Save Report this job Direct message the job poster from Owen Thomas | Pending B Corp™ Harry Ellis Harry Ellis Co-Founder at Owen Thomas | Pending B Corp™ | Building better Software Engineering teams, across Contract and Permanent | Balancing people, profit… Back End Developer, Algorithms\/Data Structures, GoLang | Crypto Exchange, Scale up | Salary Range $100,000-$130,000 Base + Stock Options + Benefits (Fully Remote) We’re seeking a talented multifaceted Back-End Developer, who is comfortable building end-to-end processes for a hyper growth scale-up - and is ready to nail a Leetcode\/System Design interview... The Company: The company is eyeing up Series B soon, with circa 50 employees with 60% of them being in Engineering. They operate a fully-remote work culture (on EU timezone) that is ambitious, dynamic and fast-paced. You will be joining the API team, bolstering the backend team of 4 currently. They encourage trust and autonomy, so this is a great opportunity to have impact and grow fast in your career. Requirements for the Back End Developer, Algorithms\/Data Structures, GoLang: Solid knowledge of basic Algorithms, Data structures and Design Patterns Confidence with complex System design Minimum 4 years of experience in designing and building distributed backend technologies\/services (ideally start-up experience) Ideally, experience with Go or Python Familiarity with the AWS cloud, Docker, Kubernetes, MongoDB, Postgres, Cassandra, Sentry, Prometheus and Grafana BONUS: Familiarity with Blockchain systems, Smart Contracts, Web 2 or 3, Solidity Remuneration : The Back End Developer, Algorithms\/Data Structures, GoLang role can pay a salary range between $100,000-$130,000 Base, however are open to reviewing candidates with expectations above or below this range. This opportunity comes with attract stock options, and other great benefits to make you feel valued and supported - if successful. If you are keen to hear more about the Back End Developer, Algorithms\/Data Structures, GoLang | Crypto Exchange, Scale up | Salary Range $100,000-$130,000 Base + Stock Options + Benefits (Fully Remote) then apply to the role and we will give you a call if we think you are a match! Show more Show less Seniority level Mid-Senior level Employment type Full-time Job function Engineering Industries Financial Services Referrals increase your chances of interviewing at Owen Thomas | Pending B Corp™ by 2x See who you know","30":"Junior\/Regular C++ Developer Luxoft Sofia, Sofia City, Bulgaria 4 weeks ago Be among the first 25 applicants See who Luxoft has hired for this role Apply Save Report this job Direct message the job poster from Luxoft Olesia Drahanchuk Olesia Drahanchuk IT Researcher Project Description Luxoft is one of the major Software Services companies worldwide. We deliver professional software services in multiple business verticals such as Finance, Automotive, and Digital Transformation. Luxoft is building up a new special purpose organization (SW House) targeted at developing In-Vehicle Infotainment (IVI) systems for the age of autonomously driving vehicles. How do people in cars spend their time? How do they interact with information and how do they best utilize the car's infrastructure in a future 2025? How to surpass all the benchmarks in automotive SW development. We believe that Software is the driving force to enable and differentiate in future environments. To achieve outstanding user experience, we build the SW House to apply the best of open source in the way that open source communities are meant to work, we focus on living continuous integration up to its most modern concepts including continuous delivery right into the vehicle. Our project setup and way of working follows agile principles scaled to a team of multiple hundred people. Combining the latest technologies, an agile way of working, and continuous striving for the best solution, we will define what IVI looks like in the future together with our OEM partner. Responsibilities As a developer, you will develop features, design, document, implement, integrate, and test platform services. Development will typically have C++ focus, and make use of modern tools and methodologies. You will identify and solve problems that require analysis by adopting existing procedures, techniques, and methods. You will actively contribute to improvements and changes take responsibility for delivery, and encourage others to do the same. Furthermore, you have a good understanding of the group's joint tasks and are seen as a person who takes full responsibility and a person who work colleagues can trust. Stack: С++17, POSIX, Linux kernel, Linux kernel modules, IPC (DBus, gRPC, TCP\/IP), Boost, docker, Yocto, AppArmor Mandatory Skills Embedded Linux (C++\/C++17) Programming skills Experience in embedded systems Familiar with design patterns and testing Experience with open-source-software, scripting, and CMake is a strong plus Experience with Linux (Yocto) Proficiency in problem-solving and troubleshooting technical issues Excellent organizational, time management, prioritization, and multi-tasking skills Ability to handle multiple competing priorities in a fast-paced environment Personal initiative, commitment, perseverance, and resilience Well-developed communication and teamwork skills Aspiration for engineering excellence Language skills: Proficient in English - B2 level Nice to have skills C#, Python, Kubernetes, Docker Languages English: B2 Upper Intermediate Show more Show less Seniority level Mid-Senior level Employment type Full-time Job function Information Technology Industries IT Services and IT Consulting Referrals increase your chances of interviewing at Luxoft by 2x See who you know","9":"Junior Developer - SAP Next Talent Program SAP Sofia, Sofia City, Bulgaria 2 weeks ago 56 applicants See who SAP has hired for this role Apply Join or sign in to find your next job Join to apply for the Junior Developer - SAP Next Talent Program role at SAP Not you? Remove photo First name Last name Email Password (6+ characters) ,  ,  .   Already on LinkedIn? Sign in Save Report this job Use AI to assess how you fit Get AI-powered advice on this job and more exclusive features. Am I a good fit for this job? Tailor my resume Sign in to access AI-powered advices Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to evaluate your skills Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to tailor your resume Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . We help the world run better At SAP, we enable you to bring out your best. Our company culture is focused on collaboration and a shared passion to help the world run better. How? We focus every day on building the foundation for tomorrow and creating a workplace that embraces differences, values flexibility, and is aligned to our purpose-driven and future-focused work. We offer a highly collaborative, caring team environment with a strong focus on learning and development, recognition for your individual contributions, and a variety of benefit options for you to choose from. If you don’t know where to start your career, start by trying everything! SAP is looking for recent graduates or students in their final year of studies who have a cloud mindset and are eager to try new things – if that sounds like you, keep reading! Skills SAP Next Talent provides an accelerated curriculum to jump-start your career by diving into the vast, innovative world of SAP with the aim to promptly advance to an unlimited associate position in the company. The 12-month full-time paid rotational program allows you to explore different technologies, develop new skills and connections, and make an impact by contributing as a full-time junior-level employee making SAP the sustainable, intelligent enterprise. Here’s how: Join a cohort of other curious, passionate, and motivated individuals Gather experience on a junior position with corresponding compensation and benefits Exposure to a vast array of teams during each unique 6-month rotation - where you will experience different technology stacks, products, industries while refining your knowledge and understanding of the business Receive impactful projects, tailored learning, robust mentorship, and networking opportunities With this program, you will be better equipped to determine which teams within SAP best align with your passions and career goals. Before completion of the program, you will be considered for placement within the company long-term, either in a team you rotate into or a similar team. To date, 90% of participants have been placed in one of these teams. This accelerator program is suitable either for current university students with outstanding academic achievements or for recent graduates with strong curiosity and applicable experience in software development. Cohort starts on May 1st, 2025. What You Bring Education or relevant practical experience in Software Development\/Engineering or similar (Bachelors, Masters, and Bootcamps welcome to apply) Must be a recent graduate during 2023 \/ 2024* ,final-year students or graduating no later than June 2026 Knowledge in general programming languages: C\/C++, C#, R, Java, JavaScript, Python, React, Node.js, HTML, Spring Boot or Go. Fluent in English; written and verbal communication skills Hands-on experience in designing, testing, and implementing solutions, Docker and Linux experience is a plus. Up to 3 years professional experience Please Note Candidates are expected to work from the Sofia office Selection process will be taking place between February-April, beginning with an invitation to complete an online technical assessment which is required to proceed. This 12 month program is not an internship but a permanent full time paid employment on a Junior role. For additional information refer to the SAP Next Talent page. #SAPNextTalent Bring out your best SAP innovations help more than four hundred thousand customers worldwide work together more efficiently and use business insight more effectively. Originally known for leadership in enterprise resource planning (ERP) software, SAP has evolved to become a market leader in end-to-end business application software and related services for database, analytics, intelligent technologies, and experience management. As a cloud company with two hundred million users and more than one hundred thousand employees worldwide, we are purpose-driven and future-focused, with a highly collaborative team ethic and commitment to personal development. Whether connecting global industries, people, or platforms, we help ensure every challenge gets the solution it deserves. At SAP, you can bring out your best. We win with inclusion SAP’s culture of inclusion, focus on health and well-being, and flexible working models help ensure that everyone – regardless of background – feels included and can run at their best. At SAP, we believe we are made stronger by the unique capabilities and qualities that each person brings to our company, and we invest in our employees to inspire confidence and help everyone realize their full potential. We ultimately believe in unleashing all talent and creating a better and more equitable world. SAP is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to the values of Equal Employment Opportunity and provide accessibility accommodations to applicants with physical and\/or mental disabilities. If you are interested in applying for employment with SAP and are in need of accommodation or special assistance to navigate our website or to complete your application, please send an e-mail with your request to Recruiting Operations Team: Careers@sap.com For SAP employees: Only permanent roles are eligible for the SAP Employee Referral Program, according to the eligibility rules set in the SAP Referral Policy. Specific conditions may apply for roles in Vocational Training. EOE AA M\/F\/Vet\/Disability Qualified applicants will receive consideration for employment without regard to their age, race, religion, national origin, ethnicity, age, gender (including pregnancy, childbirth, et al), sexual orientation, gender identity or expression, protected veteran status, or disability. Successful candidates might be required to undergo a background verification with an external vendor. Requisition ID: 418172 | Work Area: Software-Design and Development | Expected Travel: 0 - 10% | Career Status: Graduate | Employment Type: Regular Full Time | Additional Locations: . Show more Show less Seniority level Not Applicable Employment type Full-time Job function Research and Design Industries Software Development, IT Services and IT Consulting, and Business Consulting and Services Referrals increase your chances of interviewing at SAP by 2x See who you know","7":"Junior .NET Developer Accedia Sofia, Sofia City, Bulgaria 9 months ago 196 applicants See who Accedia has hired for this role Apply Join or sign in to find your next job Join to apply for the Junior .NET Developer role at Accedia Not you? Remove photo First name Last name Email Password (6+ characters) ,  ,  .   Already on LinkedIn? Sign in Save Report this job We are looking for a .NET software developer who is eager to learn, thrives in a collaborative environment, and is motivated to grow and share knowledge. What to expect: Work in a supportive environment for international clients Diversity in terms of project domain and tech stack, covering the entire software development cycle (developing new and supporting existing features, troubleshooting issues, participating in the testing process, preparing documentation, etc.) Work closely with developers of various seniority, analyze technical requirements, suggest architecture and system design solutions, estimate effort and plan tasks Actively communicate tasks, requirements, issues and open questions with your team and the client Learn new technologies, participate in various knowledge-sharing initiatives (e.g. delivering internal trainings) and take professional certifications The perfect candidate meets the following: Solid knowledge in OOP, algorithms, data structures & design patterns Application development skills and knowledge of C#\/.NET Experience in web development with HTML, CSS, JavaScript Database modeling and SQL skills Fluency in English Show more Show less Seniority level Entry level Employment type Full-time Job function Information Technology Industries Technology, Information and Internet Referrals increase your chances of interviewing at Accedia by 2x See who you know","23":"Lead Python Software Engineer SELIUK LTD Bulgaria 3 hours ago Be among the first 25 applicants See who SELIUK LTD has hired for this role Apply Save Report this job An international company which has been on the market since 2009 - the maker of of the #1 OS for web-hosting providers is looking for a Lead Python Software Engineer to join its team! Company's products are used by thousands of companies around the world, including Dell, GoDaddy, IBM, Zoom, and many others. You will be contributing to a rapidly growing product that leverages AI to automate code reviews and enhance code quality across multiple development teams. It is a fully remote company with flexible hours in European time zones (up to GMT+4). Responsibilities: Lead end-to-end development of the AI-Based Code Reviewer framework Prototype quickly, iterate based on feedback Hire and lead the team Customize the framework for specific projects and teams Collaborate with R&D teams to refine the PoC Ensure rapid delivery with high-quality standards Communicate effectively with stakeholders Requirements 5+ years of proven experience in code development and delivery Experience with AI technologies, especially in code analysis or automated review tools Demonstrated ability to lead projects or teams in software development Ability to quickly prototype and validate concepts Comfortable with rapid task switching and adapting to changing requirements Understanding of product management and aligning technical efforts with business goals English B2+ for effective team communication Long-term B2B contract Will be a plus: Familiar with startup environments and fast-paced delivery Experience customizing software tools for specific needs Previous work across multiple R&D teams Strong knowledge of code review best practices and tools Experience developing and testing proof-of-concept projects Benefits High-level compensation based on your experience Paid one month vacation per year and unlimited sick leave Medical insurance reimbursement Educational budget Co-working and gym\/sports reimbursement The opportunity to receive a reward for the most innovative idea that the company can patent Show more Show less Seniority level Mid-Senior level Employment type Full-time Job function Engineering and Information Technology Industries IT Services and IT Consulting Referrals increase your chances of interviewing at SELIUK LTD by 2x See who you know","0":"Junior Software Developer IBM Sofia, Sofia City, Bulgaria 1 week ago 41 applicants See who IBM has hired for this role Apply Join or sign in to find your next job Join to apply for the Junior Software Developer role at IBM Not you? Remove photo First name Last name Email Password (6+ characters) ,  ,  .   Already on LinkedIn? Sign in Save Report this job Introduction At IBM, work is more than a job - it's a calling: To build. To design. To code. To consult. To think along with clients and sell. To make markets. To invent. To collaborate. Not just to do something better, but to attempt things you've never thought possible. Are you ready to lead in this new era of technology and solve some of the world's most challenging problems? If so, lets talk! Your role and responsibilities You will be part of a newly established, highly motivated and skilled team working on a new and existing IBM products used by world's largest enterpise companies. Benefit of IBM decades-long experience in building the backbone of the world’s most critical businesses. Participate in design and development activities, perform code reviews and actively contribute to daily team activities (scrum\/stand-up meetings, progress checkpoints, brainstorm sessions), be able to cooperate with different teams and team members across worldwide development organisation. Required education High School Diploma\/GED Preferred Education Bachelor's Degree Required technical and professional expertise Knowledge of low-level programming languages like C and\/or C++ Understanding of data structures and algorithms Openness for new challenges and technologies Good level of English language skills, both verbal and written Ability to work well independently and in a team-oriented environment Preferred Technical And Professional Experience Educational background (including ongoing) in Computer Science, Software Engineering, Information Systems or relevant Good problem-solving and troubleshooting skills Familiarity with Bash\/Unix shell Understanding of source control systems (Git) About Business Unit IBM Systems helps IT leaders think differently about their infrastructure. IBM servers and storage are no longer inanimate - they can understand, reason, and learn so our clients can innovate while avoiding IT issues. Our systems power the world’s most important industries and our clients are the architects of the future. Join us to help build our leading-edge technology portfolio designed for cognitive business and optimized for cloud computing. YOUR LIFE @ IBM In a world where technology never stands still, we understand that, dedication to our clients success, innovation that matters, and trust and personal responsibility in all our relationships, lives in what we do as IBMers as we strive to be the catalyst that makes the world work better. Being an IBMer means you’ll be able to learn and develop yourself and your career, you’ll be encouraged to be courageous and experiment everyday, all whilst having continuous trust and support in an environment where everyone can thrive whatever their personal or professional background. Our IBMers are growth minded, always staying curious, open to feedback and learning new information and skills to constantly transform themselves and our company. They are trusted to provide on-going feedback to help other IBMers grow, as well as collaborate with colleagues keeping in mind a team focused approach to include different perspectives to drive exceptional outcomes for our customers. The courage our IBMers have to make critical decisions everyday is essential to IBM becoming the catalyst for progress, always embracing challenges with resources they have to hand, a can-do attitude and always striving for an outcome focused approach within everything that they do. Are you ready to be an IBMer? About Ibm IBM’s greatest invention is the IBMer. We believe that through the application of intelligence, reason and science, we can improve business, society and the human condition, bringing the power of an open hybrid cloud and AI strategy to life for our clients and partners around the world. Restlessly reinventing since 1911, we are not only one of the largest corporate organizations in the world, we’re also one of the biggest technology and consulting employers, with many of the Fortune 50 companies relying on the IBM Cloud to run their business. At IBM, we pride ourselves on being an early adopter of artificial intelligence, quantum computing and blockchain. Now it’s time for you to join us on our journey to being a responsible technology innovator and a force for good in the world. Other Relevant Job Details For additional information about location requirements, please discuss with the recruiter following submission of your application. Show more Show less Seniority level Entry level Employment type Full-time Job function Engineering and Information Technology Industries IT Services and IT Consulting Referrals increase your chances of interviewing at IBM by 2x See who you know","27":"Junior SAP ABAP Developer Qinlox Consulting Sofia, Sofia City, Bulgaria 1 year ago Be among the first 25 applicants See who Qinlox Consulting has hired for this role Apply Save Report this job Qinlox is one of the hidden champions in SAP implementation and combines many years of SAP knowhow and industry expertise of proven SAP logistics experts, former SAP standard developers and SAP architects. As logistics consultants, software engineers and SAP experts, with office locations in Germany and an IT Hub in Bulgaria , we are specialized in optimizing business processes, systems and organizations. We are implementation consultants and supply chain experts for the configuration, integration and optimization of warehouse logistics, intralogistics, manufacturing, procurement and demand fulfilment, distribution and transportation. As an SAP ABAP Developer you will support our customers in their SAP implementation projects You will support the implementation and integration of innovative end-to-end solutions in SAP EWM & SAP TM You will become part of a strong IT development hub in Bulgaria What distinguishes you: University degree in Informatics, Engineering or Mathematics Good understanding of OOP You are interested in new SAP technologies and ideally already have some experience with ABAP or SAP You have very good logical and reasoning skills You're a good communicator and you're a confident performer You speak fluent English German is a plus but not required What you can expect: Professional environment with challenging digital projects for well-known customers A passionate team with a can-do attitude that welcomes you with open arms Internal business and technical trainings and mentoring program during the on-boarding Development opportunities that suit you Hybrid \/ on-site work Flexible working hours Additional social benefits (up to 30 days paid leave, sports budget, professional training, language tuition, luxury health insurance, risk insurance, additional voluntary pension fund, etc.) Teambuilding and social activities Team-spirit encouraging and volunteering events Friendly working environment You are welcome to join our team! The personal data provided by you will be processed for the purposes of the recruitment process. Qinlox takes the responsibility to handle, use and store your personal data, ensuring its protection in secret from third parties. By submitting your application documents, you assure that you have taken note of and agree to our data protection declaration regarding the processing of your personal data in accordance with the GDPR. Powered by JazzHR DJwRRQz7M5 Show more Show less Seniority level Entry level Employment type Full-time Job function Information Technology Industries Internet Publishing Referrals increase your chances of interviewing at Qinlox Consulting by 2x See who you know","11":"Junior Full Stack PHP Developer Shkolo Sofia, Sofia City, Bulgaria 6 days ago Be among the first 25 applicants See who Shkolo has hired for this role Apply Join or sign in to find your next job Join to apply for the Junior Full Stack PHP Developer role at Shkolo Not you? Remove photo First name Last name Email Password (6+ characters) ,  ,  .   Already on LinkedIn? Sign in Save Report this job Company Overview With over 1,700 schools and more than 1 million users, Shkolo is Bulgaria's leading Management Information System (MIS) provider. Now a proud member of the Juniper Education group, Shkolo is expanding its products to over 16,000 schools worldwide. At Shkolo, we are revolutionizing education by leveraging cloud-based technology to enhance school efficiency, reduce teacher workload, and improve student outcomes. Our passionate team is dedicated to making a meaningful and lasting impact on education at every level. Position Overview We are looking for an enthusiastic Junior PHP Developer to join our team and help transform educational systems worldwide. In this role, you will tackle exciting technical challenges, work closely with your squad, and collaborate with colleagues across the organization. This position offers clear growth opportunities within the company, allowing you to develop your skills and advance your career while contributing to impactful projects that make a global difference. Key Responsibilities Feature Development:Assist in developing new features and functionalities for web applications using PHP (Laravel), JavaScript, HTML, and CSS. Bug Fixing:Identify, troubleshoot, and resolve bugs and issues in both front-end and back-end code. Code Maintenance:Maintain and update existing codebases to ensure continued functionality and performance. Database Management:Collaborate on designing and managing databases, including writing and optimizing SQL queries. Testing:Participate in writing and executing test cases to ensure the reliability and quality of the software. Collaboration:Work closely with senior developers, and other team members to understand project requirements and contribute to solutions. Documentation:Document development processes, code changes, and system configurations for future reference and team knowledge sharing. Optimization:Assist in optimizing website performance and ensuring efficient use of resources. Support:Provide support in troubleshooting and resolving technical issues reported by users or stakeholders. Project Management:Participate in planning and estimation for new features and projects, contributing to project timelines and deliverables. Qualifications & Skills Hard Requirements (Must-Have): Professional Experience:At least 1 years of professional experience as a Junior Full Stack PHP Developer or in a related role. Educational Background:Bachelor’s or Master’s degree in Mathematics, Computer Science, or a related field. Might be currently in university. PHP Proficiency:Solid understanding of PHP with practical experience in application development using PHP and Laravel. Front-End Skills:Experience with front-end technologies, including HTML, CSS, and JavaScript. Database Knowledge:Hands-on experience with MySQL, including writing and optimizing SQL queries. Analytical Thinking:Strong analytical and engineering thinking with a good grasp of algorithms, data structures, and software design patterns. Object-Oriented Programming (OOP):Understanding of OOP concepts and their application in software development. Version Control:Familiarity with version control systems, particularly Git. Proficiency in English:Minimum level B1 according to the Common European Framework of Reference for Languages (CEFR). Hard Requirements (Bonus) Cloud Computing:Familiarity with cloud computing platforms like AWS, GCP, or Azure. API Integration:Experience working with APIs. Education Sector Familiarity:Understanding of the education sector and its data requirements. Soft Requirements Problem-Solving:Strong problem-solving skills with the ability to critically analyze data and its implications. Communication Skills:Excellent communication skills, with the ability to present complex information in an accessible and engaging way. Attention to Detail:High attention to detail, with strong command of written and spoken English. Collaboration:Ability to work effectively within cross-functional teams and foster a collaborative environment. Continuous Learning:A proactive approach to staying updated with advancements in data science, machine learning, and educational research. What We Offer Hybrid Work Model:Enjoy a flexible work arrangement with 2 days in the office each week, following a comprehensive 3-months, 100% onsite onboarding period. Health Benefits:Additional health insurance coverage for your peace of mind. Wellness Perks:Access to a MultiSport card to support your fitness and well-being. Food Allowance:Receive food vouchers as part of your benefits package. Prime Location:Work in a centrally located office in Sofia, easily accessible by public transport. Paid Leave:Enjoy 25 days of paid leave annually, giving you ample time to spend with family and recharge. With over 1,700 schools and more than 1 million users , Shkolo is Bulgaria's leading Management Information System (MIS) provider. Now a proud member of the Juniper Education group, Shkolo is expanding its products to over 16,000 schools worldwide . At Shkolo, we are revolutionizing education by leveraging cloud-based technology to enhance school efficiency, reduce teacher workload, and improve student outcomes . Our passionate team is dedicated to making a meaningful and lasting impact on education at every level. Show more Show less Seniority level Entry level Employment type Full-time Job function Engineering and Information Technology Industries Software Development Referrals increase your chances of interviewing at Shkolo by 2x See who you know","22":"Machine Learning Engineer micro1 EMEA 16 hours ago 109 applicants See who micro1 has hired for this role Apply Join or sign in to find your next job Join to apply for the Machine Learning Engineer role at micro1 Not you? Remove photo First name Last name Email Password (6+ characters) ,  ,  .   Already on LinkedIn? Sign in Save Report this job Use AI to assess how you fit Get AI-powered advice on this job and more exclusive features. Am I a good fit for this job? Tailor my resume Sign in to access AI-powered advices Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to evaluate your skills Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to tailor your resume Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Direct message the job poster from micro1 Melina Chervone Melina Chervone Recruitment Lead at micro1  |💡Psychologist | UX Designer + Service Designer Job Title : Machine Learning Engineer Job Type : Full-time Location : Remote Job Summary Join our innovative team as a Machine Learning Engineer, where you will leverage advanced machine learning algorithms and Python expertise to build robust, end-to-end ML systems. This role is perfect for someone with a passion for recommendation engines and data-driven solutions, offering a chance to work remotely and collaborate with professionals worldwide. Key Responsibilities Design and implement scalable machine learning systems. Develop and optimize recommendation engines using advanced ML algorithms. Collaborate with cross-functional teams to integrate AI solutions into business processes. Analyze large datasets using PostgreSQL and other data handling technologies. Maintain and improve ML models with reinforcement learning from human feedback (RLHF). Engage in prompt engineering and utilize Large Language Models (LLMs). Utilize AWS and Git for system deployment and version control. Required Skills and Qualifications 5+ years of experience in machine learning and Python. Proficient in using machine learning libraries and building ML systems. Strong experience with PostgreSQL and SQL. Hands-on experience with recommendation engines and core ML algorithms. Excellent written and verbal communication skills. Experience in prompt engineering and working with LLMs. Familiarity with AWS and Git for deployment and version control. Preferred Qualifications Experience with Graph DB, specifically Neo4J and the Cypher query language. Knowledge of large-scale data handling and optimization techniques. Experience improving models with RLHF. Show more Show less Seniority level Mid-Senior level Employment type Full-time Job function Engineering Industries Software Development and IT Services and IT Consulting Referrals increase your chances of interviewing at micro1 by 2x See who you know","19":"Python Developer ICT Strypes Sofia, Sofia City, Bulgaria 20 hours ago Be among the first 25 applicants See who ICT Strypes has hired for this role Apply Join or sign in to find your next job Join to apply for the Python Developer role at ICT Strypes Not you? Remove photo First name Last name Email Password (6+ characters) ,  ,  .   Already on LinkedIn? Sign in Save Report this job You can join us at our offices in Sofia, Plovdiv, Burgas, and Varna, or choose to work remotely from anywhere in Bulgaria. Job Description Built around exceptional individuals, the end-to-end software solutions we delivered won the trust of huge enterprise corporations like ASML – one of the most influential companies in the world! They are the largest manufacturer of lithography machines that are used for the most important step in making semiconductors. More than 90% of the semiconductors in the world are currently manufactured using ASML’s systems. After 16 years of building trust, we’re now growing our teams that work on various applications that: tackle Python encryption, take care of the Statistical Process Control and Testing Support, etc.; mimic the real configuration of the lithography machines and give the user the chance to make changes and analyse them; maintain the software lifecycle of the client machine. It contains a command-line interface and modern web application; standalone Python-based applications used to calibrate the parameters, measure the Performance, and Diagnose the ASML machine. Responsibilities Implementation, testing, and integration of customer requirements for the world’s leading provider of lithography systems; Debugging and fixing problems in the existing code; Ensuring delivery on time; Ensuring up-to-date and high-quality documentation; As a Scrum team member actively participating in Scrum Sprint Plannings, Dailies, Refinement, and Retrospective Meetings; Mentor teammates; Actively participate in architectural discussions. Requirements Experience: 3+ years of experience in programming in Python; Experience in writing automated tests in Python; Strong OOP knowledge; Experience with Linux\/Unix; Understanding of the common software development processes; Good understanding of software configuration management; Experience with Agile Methodologies. Personal skills: Team player; Robust personality; Ability to work independently in a dynamic environment; Strong analytic view combined with pragmatic attitude (flexibility); Open communication attitude: active listening and giving feedback; Excellent knowledge of English (both written and verbal) is a must. Benefits Option to work remotely, on-site, or in a hybrid model. Flexible working hours. Friendly work environment. Supplementary health insurance. Loyalty programs: -after each year with the company, you receive additional paid annual leave (1 day per year, up to a maximum of 25 days). -after the third year, you can receive a budget for a car or be included in a bonus program. -after the fifth year, you will receive a one-time holiday bonus. Employee recognition program. Opportunities for technical and personal learning. Quick onboarding process. Personal freedom to solve complex problems. About Us ICT Strypes is a company with extensive experience in software development. With a team of over 700 people, we take ownership of application roadmaps for our clients and structure their overall application landscape. Founded in 2008 as a small startup, ICT Strypes became part of the Dutch ICT Group in 2014. The ICT Group, with a history of delivering IT solutions since 1978, now has subsidiaries in the Netherlands, Bulgaria, Portugal, Germany, and Sweden. Our teams consist of talented hard-working professionals who love sharing their knowledge, experience, and joyous moments with their colleagues! If you think this is the right challenge for you, please send us your CV. All applications will be treated as strictly confidential, and only short-listed candidates will be contacted. Thank you for applying! Show more Show less Seniority level Mid-Senior level Employment type Full-time Job function Information Technology Industries IT Services and IT Consulting and Semiconductor Manufacturing Referrals increase your chances of interviewing at ICT Strypes by 2x See who you know","10":"Graduate\/Associate Software Engineer - Build & Release Infrastructure Canonical Sofia, Sofia City, Bulgaria 3 weeks ago Be among the first 25 applicants See who Canonical has hired for this role Apply Join or sign in to find your next job Join to apply for the Graduate\/Associate Software Engineer - Build & Release Infrastructure role at Canonical Not you? Remove photo First name Last name Email Password (6+ characters) ,  ,  .   Already on LinkedIn? Sign in Save Report this job Drive the future of collaborative open-source development tooling as part of the Launchpad team. This is an opportunity for a motivated engineer with a passion for open-source software, Linux, and web services to join our distributed team. Launchpad is a platform for managing open-source development projects. It includes code hosting and review, bug tracking, package building, translations, and other facilities used by free and open-source software developers. It provides essential development and collaboration infrastructure for major projects such as Ubuntu. Launchpad is a mature project, mainly written in Python (primarily Zope, with some Flask). You'll be striking a balance between keeping our business-critical services running and expanding our feature set: among other things, we are currently working on expanding our package building capabilities, improving the development flows provided to our users, and modernising our web UI. If you love keeping large projects well-organised and well-maintained, care about supporting developers, and believe that continuous improvement is the key to innovation, higher velocity, and reliability, you'll fit right in. Build a rewarding, meaningful career working with the best and brightest people in technology at Canonical, a growing international software company. What you'll do Proactively collaborate within and contribute to design, architecture, and feature-selection for solutions across distributed teams Write high-quality, API-first Python code with unit tests Debug issues and produce high-quality fixes Review code produced by other engineers Work from home with global travel 2 to 4 times a year for internal and external events Who you are You love technology, working with brilliant people, and solving interesting problems You are a strategic thinker You are curious, flexible, articulate, and accountable You value soft skills and are passionate, enterprising, thoughtful, and self-motivated You have a Bachelor's or equivalent in Computer Science, STEM or similar degree You have proficiency delivering robust code to production, preferably written in Python. You have experience and enjoy maintaining and improving large and mature web applications. You have experience with databases, ORMs (PostgreSQL a plus), data management, and data modelling. You have an interest in, or experience with, integration, infrastructure and operations. You believe that robust security requires conscious efforts at every stage of delivery. You have familiarity with Ubuntu as a development and deployment platform. You have a solid understanding of the structure of various software packaging systems, including Debian\/Ubuntu packages. Location This is a remote role based in the EMEA region. Candidates will be expected to be located within this region. Canonical is proud to foster a workplace free from discrimination. We truly believe that diversity of experience, perspectives, and background will lead to a better environment for our employees and a better platform for our users and customers. This is something we value deeply, and we encourage everyone to come be a part of the world of Ubuntu. #stack Show more Show less Seniority level Entry level Employment type Full-time Job function Engineering and Information Technology Industries Technology, Information and Internet Referrals increase your chances of interviewing at Canonical by 2x See who you know","20":"Middle Java Software Engineer EPAM Systems Bulgaria 22 hours ago Be among the first 25 applicants See who EPAM Systems has hired for this role Apply Join or sign in to find your next job Join to apply for the Middle Java Software Engineer role at EPAM Systems Not you? Remove photo First name Last name Email Password (6+ characters) ,  ,  .   Already on LinkedIn? Sign in Save Report this job We are seeking a passionate Middle Java Software Engineer to join our dynamic team at EPAM. In this role, you'll tackle complex challenges, collaborate with like-minded professionals, and contribute to innovative projects that influence industries across various sectors. If you are driven, skilled in Java development, and know your way around Google Cloud Platform and testing methodologies, we want you aboard our transformative journey. Responsibilities Design and develop software solutions for critical systems in the supply chain Ensure timely project delivery and conduct direct client interactions as needed in an agile environment Produce comprehensive documentation including PRD, Test Cases, and Design Docs Write clean, efficient, and maintainable code adhering to best practices in software development Participate in code reviews to maintain quality standards Requirements 1.5+ years of experience as a software engineer Deep knowledge and proven expertise in Java and\/or Kotlin Excellent understanding of Algorithms & Data structures Familiarity with Git or other version control systems Experience with relational databases Skills in REST and Microservices Patterns Proficiency in Design Patterns Testing experience (TDD\/ATDD) Background in Continuous Integration and build tools Understanding of information management, data modeling, system integration, and development methodologies (including unit testing) Ability to deliver on time Strong self-management and prioritization skills Ability to work independently on an app from concept to finished product Willingness to participate in code reviews and engage in pair programming Excellent English communication skills and client-facing experience Nice to have Practical experience with Spring (Boot, MVC, Security) and Spring-based REST API Experience with Google Cloud Spanner and gRPC Practical experience with Kotlin Knowledge of Guice, Protocol Buffers, Guava, Junit 4, Mockito Experience with modern JS frameworks and Rapid Application development platforms We offer Opportunity to Engineer your Future and to drive the world’s digital transformation with top industry clients Personal development program that will allow you to be valued for your strengths Wide range of professional trainings and workshops Being part of a collaborative, fast-growing, and innovative design team Established and accelerated growth toward different career paths, competencies, and roles Broad projects variety and possible mobility between projects over the time Collaboration in a multicultural environment and exchange of best practices with colleagues around the world Varied social benefits, Sports, Transportation and Health programs Work-life balance and flexible schedule, team buildings and sport opportunities Modern office\/collaboration spaces (incl. new Infinity Tower business center, Sofia) Hybrid By Design - we provide you with the best productivity options from the 2 worlds. Meet, socialize and enjoy F2F time with your colleagues, while working from the modern EPAM's office for a few days per week and benefit from the EPAM's virtual working environment - making you able to be productive and work from remote for the rest of the week Show more Show less Seniority level Associate Employment type Full-time Job function Information Technology, Engineering, and Business Development Industries Software Development and IT Services and IT Consulting Referrals increase your chances of interviewing at EPAM Systems by 2x See who you know","5":"Junior Data Engineer DXC Technology Bulgaria 2 weeks ago Over 200 applicants See who DXC Technology has hired for this role Apply Save Report this job Direct message the job poster from DXC Technology Olga Dobreva Olga Dobreva Great company without great people is irrelevant. Project Description: DXC Technology (NYSE: DXC) is the world's leading independent, end-to-end IT services company, helping clients harness the power of innovation to thrive on change. Created by the merger of CSC and the Enterprise Services business of Hewlett Packard Enterprise, DXC Technology serves nearly 6,000 private and public sector clients across 70 countries. The company's technology independence, global talent and extensive partner alliance combine to deliver powerful next-generation IT services and solutions. DXC Technology is recognized among the best corporate citizens globally. At DXC Technology our employees' safety and well-being remain a key priority for us. Therefore, we continue with stay-at-home recruitment and video interviewing for the foreseeable future. • Do you have experience with Python and SQL? • Do you have experience with ETL? • Do you want to gain New Skills and Certifications? Join our Data & AI team! We are growing our Analytics Data Engineering team which is based in Sofia but also offers fully remote positions! We live in a data-driven world where data can be leveraged for reporting & analyses and for data-driven products and applications. Our team has strong experience in Analytics solutions and Data Engineering based on the latest cloud technologies. Here you will gain hands-on experience working with world-famous brands and Fortune 500 companies in a diverse team where everybody has a lot to contribute with - including yourself! The team is constantly growing with over 60 experts in the field. Responsibilities: • Developing solutions to transform large data sets using Apache Spark and PySpark • Data manipulation and transformations using Azure services and Snowflake • Develop and implement solutions to automate the system • Work in an agile project team that has specific goals and deliverables • Implements solution components according to the project requirements Mandatory Skills Description: • University degree in Computer science, other related area, or equivalent work experience • Practical knowledge of Python and SQL • 6+ months of experience • Fluent English • Ability to manage tasks efficiently and able to meet deadlines • Highly motivated team player, willing to work in an agile environment Nice-to-Have Skills Description: • Databricks • Azure ( or Other Cloud technologies) • Snowflake • MySQL Languages: English: C1 Advanced Show more Show less Seniority level Entry level Employment type Full-time Job function Engineering, Information Technology, and Other Industries IT Services and IT Consulting Referrals increase your chances of interviewing at DXC Technology by 2x See who you know","28":"Python Developer - LLM YO IT CONSULTING Bulgaria 4 months ago 33 applicants See who YO IT CONSULTING has hired for this role Apply Save Report this job Use AI to assess how you fit Get AI-powered advice on this job and more exclusive features. Am I a good fit for this job? Tailor my resume Sign in to access AI-powered advices Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to evaluate your skills Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to tailor your resume Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . YO IT CONSULTING provided pay range This range is provided by YO IT CONSULTING. Your actual pay will be based on your skills and experience — talk with your recruiter to learn more. Base pay range $12.00\/hr - $22.00\/hr LLM Python Developer Experience: 3 - 6 Years Contract Duration: 6 Months Opportunity- Full Time, 8 hours, Overlap Required: 5 hours Pst Total Years Of exp - 3+ years Mandatory Skills - Python min 2+ years. Technical Writing - min 2 yrs. Job Description We are actively seeking talented Senior Python Developers to join our ambitious team dedicated to pushing the frontiers of AI technology. This opportunity is tailored for professionals who thrive on developing innovative solutions and who aspire to be at the forefront of AI advancements. You will work with different companies in the US who are looking to develop both commercial and research AI solutions. Required Skills Write effective Python code to tackle complex issues Use business sense and analytical abilities to glean valuable insights from public databases Clearly express the reasoning and logic when writing code in Jupyter notebooks or other suitable mediums Extensive experience working with Python Proficiency with the language's syntax and conventions Previous experience tackling algorithmic problems Nice to have some prior Software Quality Assurance and Test Planning experience Excellent spoken and written English communication skills Required Skills For TWA The ideal candidates should be able to Clearly explain their strategies for problem-solving. Design practical solutions in code. Develop test cases to validate their solutions. Debug and refine their solutions for improvement. Skills: python,spoken english communication,analytical skills,refinement,spoken and written english communication skills,test planning,conventions,english communication,business analysis,written communication,algorithmic problems,django,designing practical solutions in code,problem-solving strategies,syntax conventions,public databases,syntax and conventions,analytical abilities,syntax and conventions of python,writing,design,english,business sense,technical writing,refining solutions,test cases,jupyter,developing test cases,problem-solving,debugging and refining solutions,refining,machine learning,software quality assurance,excellent communication,test case development,algorithmic problem-solving,written english communication,code,developers,jupyter notebooks,artificial intelligence,algorithmic problem solving,flask,debugging,communication skills,databases,spoken communication Show more Show less Seniority level Mid-Senior level Employment type Contract Job function Engineering and Information Technology Industries Technology, Information and Internet Referrals increase your chances of interviewing at YO IT CONSULTING by 2x See who you know","25":"Middle Java Software Engineer SoftServe Bulgaria 17 hours ago Be among the first 25 applicants See who SoftServe has hired for this role Apply Join or sign in to find your next job Join to apply for the Middle Java Software Engineer role at SoftServe Not you? Remove photo First name Last name Email Password (6+ characters) ,  ,  .   Already on LinkedIn? Sign in Save Report this job WE ARE SoftServe is a global digital service and consulting company founded in 1993. With thousands of associates working on 2,000+ projects worldwide, we help transform, accelerate, and optimize how our clients do business. Our team of authentic professionals solves business challenges with innovative technology solutions across the USA, Europe, APAC, and LatAm regions. Our client is an Australian-based software company that provides collaboration and development tools for software development teams. Their suite of products includes issue tracking, project management, code repository management, and code coverage metrics tools. They cater to various industries globally, including technology, banking and finance, health and biotechnology, and government sectors. With offices in Australia, the USA, and Europe, our client continues to innovate and expand their reach to help teams build better products. We as a team are responsible for building actions for third parties that can be executed by Generative AI (Rovo) and integrated within the Atlassian ecosystem. IF YOU ARE A skilled Java engineer with 3+ years of experience developing highly available enterprise web applications and experience with Kotlin Proficient in GraphQL and capable of building REST APIs An expert in the Spring Framework, including MVC, Boot, Security, and Data Experienced in testing with tools like JUnit and Mockito Knowledgeable about cloud technologies, including SaaS, PaaS, IaaS, and public cloud platforms such as AWS Familiar with containerization tools like Docker and Kubernetes Strong in problem solving, debugging, and troubleshooting complex systems Collaborative and team-oriented, with a focus on delivering results together Accustomed to Agile practices, including methodologies such as Scrum or Kanban A strong communicator with upper-intermediate English proficiency Familiar with JQ, or Python (nice to have) Versed in Generative AI and prompting techniques (as an advantage) Experienced with CI\/CD tools and pipelines (would be a plus) AND YOU WANT TO Develop AI-driven actions for popular third-party products that integrate seamlessly with the Atlassian ecosystem through generative AI (Rovo) Create and maintain connectors for third-party services using their public APIs Design advanced AI prompting templates with complex contexts to enable new actions in communication scenarios Enhance software quality through rigorous code reviews, testing, and optimization Ensure smooth operations through code maintenance and troubleshooting Collaborate with cross-functional teams by attending meetings and aligning on project goals and timelines Engage with clients to understand their requirements and deliver tailored technical solutions TOGETHER WE WILL Empower your expertise and creativity in a world-renowned software development company that recently announced a new product to support AI functionality and integrate systems Join a diverse team of professionals in a collaborative enterprise environment, where you can share ideas and learn from others while working towards a common goal Enhance your leadership skills with managerial competencies through our Leadership Development Programs, designed to empower emerging and mature leaders to deliver more value Get opportunities for professional growth and learning through our continuous training programs and online learning portals SoftServe is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment regardless of race, color, religion, age, sex, nationality, disability, sexual orientation, gender identity and expression, veteran status, and other protected characteristics under applicable law. Let’s put your talents and experience in motion with SoftServe Show more Show less Seniority level Associate Employment type Full-time Job function Information Technology and Engineering Industries IT Services and IT Consulting Referrals increase your chances of interviewing at SoftServe by 2x See who you know","31":"Python Developer ICT Strypes Bulgaria 20 hours ago 50 applicants See who ICT Strypes has hired for this role Apply Join or sign in to find your next job Join to apply for the Python Developer role at ICT Strypes Not you? Remove photo First name Last name Email Password (6+ characters) ,  ,  .   Already on LinkedIn? Sign in Save Report this job Use AI to assess how you fit Get AI-powered advice on this job and more exclusive features. Am I a good fit for this job? Tailor my resume Sign in to access AI-powered advices Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to evaluate your skills Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to tailor your resume Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . You can join us at our offices in Sofia, Plovdiv, Burgas, and Varna, or choose to work remotely from anywhere in Bulgaria. Job Description Built around exceptional individuals, the end-to-end software solutions we delivered won the trust of huge enterprise corporations like ASML – one of the most influential companies in the world! They are the largest manufacturer of lithography machines that are used for the most important step in making semiconductors. More than 90% of the semiconductors in the world are currently manufactured using ASML’s systems. After 16 years of building trust, we’re now growing our teams that work on various applications that: tackle Python encryption, take care of the Statistical Process Control and Testing Support, etc.; mimic the real configuration of the lithography machines and give the user the chance to make changes and analyse them; maintain the software lifecycle of the client machine. It contains a command-line interface and modern web application; standalone Python-based applications used to calibrate the parameters, measure the Performance, and Diagnose the ASML machine. Responsibilities Implementation, testing, and integration of customer requirements for the world’s leading provider of lithography systems; Debugging and fixing problems in the existing code; Ensuring delivery on time; Ensuring up-to-date and high-quality documentation; As a Scrum team member actively participating in Scrum Sprint Plannings, Dailies, Refinement, and Retrospective Meetings; Mentor teammates; Actively participate in architectural discussions. Requirements Experience: 3+ years of experience in programming in Python; Experience in writing automated tests in Python; Strong OOP knowledge; Experience with Linux\/Unix; Understanding of the common software development processes; Good understanding of software configuration management; Experience with Agile Methodologies. Personal skills: Team player; Robust personality; Ability to work independently in a dynamic environment; Strong analytic view combined with pragmatic attitude (flexibility); Open communication attitude: active listening and giving feedback; Excellent knowledge of English (both written and verbal) is a must. Benefits Option to work remotely, on-site, or in a hybrid model. Flexible working hours. Friendly work environment. Supplementary health insurance. Loyalty programs: -after each year with the company, you receive additional paid annual leave (1 day per year, up to a maximum of 25 days). -after the third year, you can receive a budget for a car or be included in a bonus program. -after the fifth year, you will receive a one-time holiday bonus. Employee recognition program. Opportunities for technical and personal learning. Quick onboarding process. Personal freedom to solve complex problems. About Us ICT Strypes is a company with extensive experience in software development. With a team of over 700 people, we take ownership of application roadmaps for our clients and structure their overall application landscape. Founded in 2008 as a small startup, ICT Strypes became part of the Dutch ICT Group in 2014. The ICT Group, with a history of delivering IT solutions since 1978, now has subsidiaries in the Netherlands, Bulgaria, Portugal, Germany, and Sweden. Our teams consist of talented hard-working professionals who love sharing their knowledge, experience, and joyous moments with their colleagues! If you think this is the right challenge for you, please send us your CV. All applications will be treated as strictly confidential, and only short-listed candidates will be contacted. Thank you for applying! Show more Show less Seniority level Mid-Senior level Employment type Full-time Job function Information Technology Industries IT Services and IT Consulting and Semiconductor Manufacturing Referrals increase your chances of interviewing at ICT Strypes by 2x See who you know","2":"Junior Python Developer DXC Technology Sofia, Sofia City, Bulgaria 3 months ago Over 200 applicants See who DXC Technology has hired for this role Apply Join or sign in to find your next job Join to apply for the Junior Python Developer role at DXC Technology Not you? Remove photo First name Last name Email Password (6+ characters) ,  ,  .   Already on LinkedIn? Sign in Save Report this job Use AI to assess how you fit Get AI-powered advice on this job and more exclusive features. Am I a good fit for this job? Tailor my resume Sign in to access AI-powered advices Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to evaluate your skills Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to tailor your resume Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Job Description About DXC Bulgaria We are DXC - a Fortune 500 global IT services leader. In Bulgaria, we are among the largest employers with over 4,000 employees working on the company's entire IT portfolio. We are flexible - we provide everything you need to comfortably work from home, but we also keep our offices open for collaboration, meetings, and building a strong team spirit. We tailor everyone’s development path to their individual interests through training and additional certifications. Our experience and desire to grow, our mission, and our values create an environment where ambitious people become successful at home. At home - in Bulgaria . We offer a unique opportunity to participate in the digital transformation of the car industry, which will change the way we perceive car transportation. Self-driving cars are on the way and that is your chance to enter and take part in their development. Join our Analytics Team in the Junior Python Developer role! You will be working with Data Engineers, Senior Software Developers, Data Scientists and DevOps Experts to deliver analytic platforms and solutions that would enable autonomous driving. D aily Challenges Design and implement software solutions to manage the data used for the development of autonomous cars Developing solutions to transform large data sets using Apache Spark and PySpark Data manipulation and transformations using Azure services and Snowflake Develop and implement solutions to automate the system Work in an agile project team that has specific goals and deliverables Implements solution components according to the project requirements EXperience And Skills Required Some experience with Python Experience with relational databases and SQL development University degree in Computer Science, other related areas or equivalent work experience Fluent English Desire to learn the cloud technologies and work with data Ability to manage tasks efficiently and able to meet deadlines Good communication skills Highly motivated team player, willing to work in an agile environment Company Benefits Competitive remuneration package Additional Medical & Life insurance 4 days additional paid leave (total: 24 days) The possibility to work entirely remotely Food vouchers Training, continuous learning and career development in the largest IT company on the market Unlimited access courses from a bunch of external partners for the best learner's experience (e.g., LinkedIn Learning, Udemy) Access to a foreign language learning platform Stable employment in an international company Advancement opportunities within the organization (a variety of interesting projects with the array of technologies and tools) Flexibility in work arrangement (hybrid or fully remote work, the home office culture is in our DNA) Workplace equipment to organize your home office (e.g., chair, desk, additional monitor, headset etc.) DXC Partner courses and certifications (Microsoft, SAP, ServiceNow, AWS, Google, Dell Technologies, IBM, Micro Focus, Salesforce, Red Hat, VMware, Workday) Employee Referral Program - a financial bonus for the referrer for successful candidate recommendation Employee Recognition Program with points assigned by colleagues for the recognized employees (exchangeable for prizes) Employee Assistance Program (providing 24\/7 support for employees and their families in difficult life situations) Opportunity to join our numerous charity and ecology-related events organized by our Employee Ambassadors team We Deliver eXcellence for our Customers and colleagues every day. Our values form the foundation of everything we do and every decision we make. If you feel comfortable with the above-mentioned requirements, please send us your CV in English. At DXC our employees’ safety and well-being remain a key priority for us. Therefore, we continue with stay-at-home recruiting and video interviewing for the foreseeable future. Please note only shortlisted candidates will be contacted. Recruitment fraud is a scheme in which fictitious job opportunities are offered to job seekers typically through online services, such as false websites, or through unsolicited emails claiming to be from the company. These emails may request recipients to provide personal information or to make payments as part of their illegitimate recruiting process. DXC does not make offers of employment via social media networks and DXC never asks for any money or payments from applicants at any point in the recruitment process, nor ask a job seeker to purchase IT or other equipment on our behalf. More information on employment scams is available here . Show more Show less Seniority level Entry level Employment type Full-time Job function Engineering and Information Technology Industries IT Services and IT Consulting Referrals increase your chances of interviewing at DXC Technology by 2x See who you know","12":"Software Engineer I (Remote Eligible in Bulgaria) Smartsheet Bulgaria 3 weeks ago Over 200 applicants See who Smartsheet has hired for this role Apply Join or sign in to find your next job Join to apply for the Software Engineer I (Remote Eligible in Bulgaria) role at Smartsheet Not you? Remove photo First name Last name Email Password (6+ characters) ,  ,  .   Already on LinkedIn? Sign in Save Report this job Smartsheet is a tech company with a human story to tell. We’re here to empower teams to manage projects, automate workflows, and rapidly build new secure solutions, using simple no-code tools. We’re revolutionaries – so for us changing the way the world works is all in a day’s work. As a global leader in Collaborative Work Management and with a market cap of $10bn we’ve experienced incredible growth in EMEA, expanding from 1 team and 3 engineers in 2018 to 9 teams with over 70 engineers in 2024. As we expand into Bulgaria and build out a new operation, we're searching for talented and motivated Software Engineers who are passionate about continuous learning and eager to grow along with us in a fast-paced, innovative environment. This position will be employed through a third-party employer of record initially, with the intention to convert to full time employment directly with Smartsheet once our entity in Bulgaria is established (in H1 2025). You will report to an engineering leader located in Bulgaria. You Will Contribute to the entire development lifecycle, from concept to release, ensuring quality at every step. Participate in system architecture discussions to design scalable, high-availability applications. Implement new features and improve existing functionality to enhance our product offerings.. Maintain and develop service APIs that serve millions of users. Collaborate with systems engineers to debug infrastructure challenges. Take part in all phases of quality assurance and defect resolution to maintain the reliability of our systems. Work across multiple disciplines such as front-end, back-end, test automation, and infrastructure to broaden your technical expertise. Perform other duties as assigned. You Have Experience with programming languages like Golang, Java, C, or Node.js. Familiarity with front-end technologies (HTML, CSS, JavaScript, React.js) Knowledge of Object-Oriented design and Microservice Architecture. Experience with scalable, high-availability applications. Comfort working in Linux command line environments. A degree in Computer Science or equivalent industry experience. Legally eligible to work in Bulgaria on an ongoing basis. Fluency in English is required. Nice To Have Experience with DynamoDB, MySQL, or other relational and non-relational databases. Familiarity with AWS and Docker, or AWS certifications (AWS Developer, AWS Solution Architect). Experience with service orchestration tools like Kubernetes or HashiCorp Get To Know Us At Smartsheet, we’ve created a place where everyone is welcome — people from all over the world, all backgrounds, all ages, all colors, and all beliefs working side by side. Here, everyone can make a difference and empower others to do the same. You’re encouraged to apply even if your experience doesn’t precisely match our job description—if your career path has been nontraditional, that will set you apart. At Smartsheet, we empower everyone, everywhere to change the way the world works—join us! Equal Opportunity Employer Smartsheet is an Equal Opportunity (EEO) employer committed to fostering an inclusive environment with the best employees. It is our policy to provide equal employment opportunities to all qualified applicants in accordance with applicable laws in the US, UK, Australia, Germany, Costa Rica, Japan, and Bulgaria. All qualified applicants will receive consideration without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, protected veteran or disabled status, or genetic information. If there are preparations we can make to help ensure you have a comfortable and positive interview experience, please let us know. Show more Show less Seniority level Entry level Employment type Full-time Job function Engineering and Information Technology Industries Software Development Referrals increase your chances of interviewing at Smartsheet by 2x See who you know","3":"Junior Java Engineer Dreamix Sofia, Sofia City, Bulgaria 3 weeks ago Over 200 applicants See who Dreamix has hired for this role Apply Save Report this job Use AI to assess how you fit Get AI-powered advice on this job and more exclusive features. Am I a good fit for this job? Tailor my resume Sign in to access AI-powered advices Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to evaluate your skills Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to tailor your resume Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Dreаmix was founded 18 years ago by passionate IT students, who wanted to create the dreamiest workplace where everyone is heard, works under transparent management, and lives up to their full potential. Now, many years later, we deliver software solutions for renowned companies from Germany, the UK, Switzerland, and Silicon Valley. Dreamix provides quality software services and products for top enterprises around the world through Java and Web technologies. We believe the employer-employee relationship must be in the form of a partnership, not a transaction. You can be sure that we'll invest as much as we can in your development, but we expect the same commitment to Dreamix. Our culture is defined by our actions not by what we say. Currently, we are seeking a passionate and detail-oriented Junior Java Engineer . As a key member of our development team, you will play a crucial role in building and maintaining high-quality software applications, ensuring reliable performance, and contributing to the design and implementation of scalable solutions. If you join our team you will: Develop and maintain Java applications in a collaborative environment Write clean, scalable, and efficient code Participate in code reviews and and give improvement suggestions Troubleshoot, debug, and optimize existing software Collaborate with cross-functional teams to define, design, and deliver new features Stay updated with emerging technologies and apply them to your work What qualifications you should have: Bachelor's degree in Computer Science, Software Engineering, or a related field (or equivalent experience) Strong understanding of Java programming language Familiarity with common frameworks such as Spring or Hibernate Knowledge of databases (SQL, MySQL, etc.) Fluent in English, both written and verbal Excellent communication and teamwork abilities Eagerness to learn and grow in a fast-paced environment What you'll get: A warm and supportive work environment where you can reach your full potential Flexible working hours that allow you to balance your work and personal life Unlimited home office to help you stay productive and focused Opportunities for professional development, including certifications and training Additional benefits for academic teaching and speaking engagements Knowledge-sharing sessions where you can learn from our Dreamix team Team and company-wide events that bring us together Amazing week long summer office and winter office initiatives Additional health insurance and dental allowance to ensure your well-being Multisport card to encourage a healthy and active lifestyle Office massages to help you relax and unwind If you have a passion for coding, a solid foundation in Java programming, and a desire to contribute to innovative software solutions, this could be the perfect opportunity for you. Apply by sending us your CV ! Only shortlisted candidates will be contacted. The confidentiality of all applications is assured! By applying for this job, you voluntarily agree and submit your personal information. Any personal data that you provide will be processed in strict confidentiality by Dreamix ltd. only for the purposes of selection and recruitment and will not be transferred to other data controllers unless required by law. It will be stored, processed, retrieved, and deleted in accordance with the GDPR. Show more Show less Seniority level Entry level Employment type Full-time Job function Information Technology Industries IT Services and IT Consulting Referrals increase your chances of interviewing at Dreamix by 2x See who you know","4":"Junior Backend Developer LimeChain - Blockchain & Web3 Solutions Sofia Metropolitan Area 3 weeks ago 174 applicants See who LimeChain - Blockchain & Web3 Solutions has hired for this role Apply Save Report this job Use AI to assess how you fit Get AI-powered advice on this job and more exclusive features. Am I a good fit for this job? Tailor my resume Sign in to access AI-powered advices Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to evaluate your skills Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to tailor your resume Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . LimeChain is a global leader in Web3 development and innovation , working with Fortune 500 clients and Web3 startups. We’re experts in crafting dApps, blockchain networks, and enterprise solutions using a wide range of Web3 technologies. With over 220 projects under our belt and a team of more than 120 industry experts, we are now one of the companies with the most accumulated know-how in the Web3 space. We're looking for driven, curious, and committed individuals at the start of their careers to join our team as Junior Software Developers. Juniors will start with an immersive 3-month training program guided by a dedicated mentor, designed to bring their skills and knowledge to the next level. Through commitment and passion during this period, juniors will transition into LimeChain’s teams to work on real-world Web3 projects that are shaping the future. What will you be doing: Building and maintaining REST APIs Completing assigned tasks with minimal supervision while meeting deadlines Demonstrating a proactive attitude when blocked or in need of new tasks Communicating progress transparently and ensuring task visibility Managing time efficiently and seeking help when necessary Collaborating with the team to break down tasks of small to medium complexity Addressing code review feedback quickly Participating in code reviews and providing thoughtful feedback What you bring to the table: Experience with at least one back-end programming language or framework (Golang\/Node.js\/Java\/Rust) Basic understanding of the HTTP protocol Familiarity with version control systems and basic Git workflows Knowledge of task tracking tools such as Jira or GitHub Issues Experience in creating REST APIs Eagerness to learn and grow in a back-end development role in the web3 context Strong work ethic, with the ability to collaborate and work transparently with the team Ability to manage time effectively and adapt to changing priorities Willingness to accept and learn from feedback #OneOfLime Perks: Opportunity to enter the exciting world of Web3 and learn from some of the best minds in the industry; Don’t worry, our blockchain onboarding will pave your way for an epic journey Real Impact: We are working on some of the most exciting projects in Web3 using the latest technologies. Your code won’t just run – it’ll reshape industries A house full of more than 160 Limes – a “Lime” is a person that is willing to go the extra mile, that is determined, a top performer, a life learner and an explorer Unlock up to 25 days of annual leave, rewarding your commitment with us Car allowance – Limes receive financial and administrative support for purchasing a personal vehicle after their second year with us Flexible working hours – Need to finish some personal errands in the morning? That’s fine! Additional healthcare – We got your premium medical and dental care covered Sport by passion – Sport initiatives, tournaments, internal sports clubs (Lime Run Club, FC LimeChain and more) and fellow Limes passionate about longevity and peak performance Two epic team building events per year, as well as monthly team bonding events аnd fiery game nights Wednesday team feast and daily snacks – we treat ourselves to daily goodies throughout the week Merch and Gifts – we love our branded swag as we believe in showing our appreciation in style Show more Show less Seniority level Entry level Employment type Full-time Job function Engineering, Information Technology, and Other Industries Information Services, Software Development, and IT Services and IT Consulting Referrals increase your chances of interviewing at LimeChain - Blockchain & Web3 Solutions by 2x See who you know","1":"Junior Software Engineer Trading 212 Sofia, Sofia City, Bulgaria 1 week ago Over 200 applicants See who Trading 212 has hired for this role Apply Join or sign in to find your next job Join to apply for the Junior Software Engineer role at Trading 212 Not you? Remove photo First name Last name Email Password (6+ characters) ,  ,  .   Already on LinkedIn? Sign in Save Report this job Our mission is to enable everyone to build wealth We reinvent how trading and investing work by creating exceptional products people love. Fostering a culture of excellence and high velocity is the key to our success. Over the past few years, our client base has grown 20 times to over 3 million, and client assets have grown over 50 times to over €4 billion. What You’ll Do Develop solutions by taking a holistic approach to problem-solving - Work with your team to understand business problems, service architecture, and underlying technologies. You'll be guided to take a holistic approach to problem-solving while learning to consider all aspects of a solution. Engage in forming requirements, design your implementation, code it, test it, deploy and monitor it – Participate in forming requirements, designing implementations, coding, testing, deploying, and monitoring solutions. You'll be supported in taking ownership of your code, ensuring it's well-maintained, and refactoring it when opportunities for improvement arise. Develop for performance, scale and resilience – Learn to develop code that performs well, scales effectively, and is resilient. Understand the importance of minimizing downtime, latency, and data loss, and work towards achieving these goals with support from your team. Work in compact, autonomous teams with short release cycles - Collaborate within compact, autonomous teams with short release cycles. You'll be part of an agile, independent team where you'll learn to balance the right amount of process to maintain velocity without sacrificing structure. Learn from your colleagues and share your knowledge with them - Actively learn from your colleagues and share your knowledge with them. Participate in mutual, honest feedback to help grow individually and as a company. What You Need To Have Ongoing or completed CS education. Familiarity with common communication protocols. We expect you to be comfortable with using HTTP & AMQP communication and have the ability to decide when to use one over the other. Prior experience with at least one commonplace web framework, no matter the language. Our system is language-agnostic and we give the engineers the opportunity to choose the specific language based on its appropriateness for the particular task. The microservice architecture allows us to use the newest technologies and we're constantly striving to keep a healthy balance between an up-to-date system and a battle-tested and familiar one. Good understanding of RDBMS concepts. We expect you to know about database indexing and transactions, and you should be able to design basic databases. Our tech stack Languages and frameworks: Java 17 - Spring, Go, JavaScript - ReactNative + TypeScript Databases: Apache Cassandra, MariaDB, Redis, Elasticsearch, TimescaleDB, ClickHouse Messaging: Apache Kafka Web servers: Nginx, HAProxy, Envoy Version control: Git Logs & Monitoring: Grafana, Kibana, StatsD (Telegraf) Team communication: Slack What We Offer Challenges that will help you grow and realize your potential really fast Opportunity to make a big Impact - you will build innovative services used by millions of investors to build wealth Work with smart, spirited, helpful, high-performing colleagues with a common goal An environment where nothing is set in stone Appreciation for your talent and ideas Generous remuneration package including annual bonuses Excellent social benefits package, including private health insurance, sports card and 25 days of paid vacation per year Delicious treats and a spacious game room Are you ready to accelerate your career with us? We'd love to hear from you! We thank all applicants, but only candidates selected for an interview will be contacted. All personal data of applicants is protected by the law and will be treated with strict confidentiality. Show more Show less Seniority level Entry level Employment type Full-time Job function Engineering Industries Financial Services Referrals increase your chances of interviewing at Trading 212 by 2x See who you know","33":"Software Architect Nexo Careers Sofia, Sofia City, Bulgaria 1 day ago Be among the first 25 applicants See who Nexo Careers has hired for this role Apply Join or sign in to find your next job Join to apply for the Software Architect role at Nexo Careers Not you? Remove photo First name Last name Email Password (6+ characters) ,  ,  .   Already on LinkedIn? Sign in Save Report this job Direct message the job poster from Nexo Careers Sonya Georgieva Sonya Georgieva Senior IT Recruitment Consultant Stand out and drive the next generation of wealth. ​Define the digital assets industry. Raise the bar for trust, transparency, and client success. Make your mark. Nexo is a premier digital assets wealth platform designed to empower clients to grow, manage, and preserve their crypto holdings. Our mission is to lead the next generation of wealth creation by focusing on customer success and delivering tailored solutions that build enduring value, supported by 24\/7 client care. Since 2018, Nexo has provided unmatched opportunities to forward-thinking clients in over 200 jurisdictions. With over $7 billion in AUM and $320 billion processed, we bring lasting value to millions worldwide. Our all-in-one platform combines advanced technology with a client-first approach, offering high-yield flexible and fixed-term savings, crypto-backed loans, sophisticated trading tools, and liquidity solutions, including the first crypto debit\/credit card. Built on deep industry expertise, a sustainable business model, robust infrastructure, stringent security, and global licensing, Nexo champions innovation and long-lasting prosperity. Official website: nexo.com Your role: Develop architectural solutions for applications, databases, and web services. Decide on the platforms and coding standards to be used in project development. Evaluate existing software solutions to identify areas for improvement. Create modifications for existing software to upgrade performance. Ensure architectural integrity of software solutions. Maintain thorough documentation of systems and applications. Collaborate with programmers and developers to determine functional and non-functional requirements for new software or applications. Communicate successfully all concepts and guidelines to development team. Provide technical guidance and coaching to developers and engineers. What makes you stand out: Bachelor’s degree in Computer science, Software engineering or related field. Experience in a software development role. Extensive understanding of architectural styles and design patterns. Familiarity with several coding and computer languages. Experience with database design and data modeling. Understanding of software development lifecycle (SDLC). Superior interpersonal communication skills. A technical mindset with great attention to detail. Experience with AWS. Desired (but not essential): Experience with decentralized IT and distributed systems. A good understanding of the blockchain technology and the digital assets space. Passion for innovation and disruption in the blockchain ecosystem. Nexo benefits: Competitive and rewarding remuneration package. Annual performance-based bonuses. Comprehensive Learning Hub for continuous growth. Hybrid work model: primarily office-based with scheduled home office flexibility. A dynamic and inspiring environment with cutting-edge projects. Career development opportunities in a global leader driving the next generation of wealth. Customizable personal benefits package. Wellness benefits include additional health insurance, all-access sports cards, team-wide sports activities, standing desks, and blue light glasses. Free parking with a designated space, free electric bikes, and public transportation cards. Fresh fruits, snacks, and a well-stocked office kitchen. Regular department team buildings and company-wide team buildings. Show more Show less Seniority level Mid-Senior level Employment type Full-time Job function Engineering Industries Banking Referrals increase your chances of interviewing at Nexo Careers by 2x See who you know","21":"Bachelor\/ Masters pursuing Student - Study  Opportunity in the UAE Business Umbrella - Recruitment, Training, Consulting, Licensing Healthcare Education Real estate EMEA 2 hours ago 52 applicants See who Business Umbrella - Recruitment, Training, Consulting, Licensing Healthcare Education Real estate has hired for this role Apply Join or sign in to find your next job Join to apply for the Bachelor\/ Masters pursuing Student - Study  Opportunity in the UAE role at Business Umbrella - Recruitment, Training, Consulting, Licensing Healthcare Education Real estate Not you? Remove photo First name Last name Email Password (6+ characters) ,  ,  .   Already on LinkedIn? Sign in Save Report this job Direct message the job poster from Business Umbrella - Recruitment, Training, Consulting, Licensing Healthcare Education Real estate Amani Binni Amani Binni Senior Operations Manager | Government Project Manager | Human Resources Manager | BDM | Talent Acquisition | Management Consulting | Recruitment… For university program Location: United Arab Emirates (UAE) Are you an ambitious and talented international student seeking an enriching study and work experience in the United Arab Emirates (UAE)? Our institution offers exciting opportunities for students from around the world to pursue their academic goals while gaining valuable work experience in various sectors of the UAE's vibrant economy. We welcome students from diverse backgrounds and fields of study to join our dynamic community and contribute to their personal and professional growth. Study and Work Opportunities Available: Healthcare Sector: Medical Internships: Gain clinical experience and practical skills in hospitals, clinics, and healthcare facilities. Nursing Assistantships: Assist healthcare professionals in patient care, treatment, and rehabilitation activities. Research Assistantships: Contribute to medical research projects and advancements in healthcare technologies. Engineering Sector: Engineering Internships: Apply engineering principles to real-world projects in areas such as civil, mechanical, electrical, and aerospace engineering. Design and Development Projects: Participate in design competitions, prototype development, and innovation challenges. Arts and Humanities: Creative Arts Workshops: Explore your artistic talents and express yourself through visual arts, performing arts, and creative writing. Cultural Exchange Programs: Engage in cross-cultural dialogue and artistic collaboration with local and international artists. Business and Commerce: Business Internships: Gain practical experience in areas such as marketing, finance, human resources, and management consulting. Entrepreneurial Ventures: Develop business ideas, launch startups, and participate in incubation programs and pitch competitions. Information Technology (IT) and Artificial Intelligence (AI): IT Internships: Work on software development, cybersecurity, data analytics, and emerging technologies projects. AI Research and Development: Explore the latest advancements in artificial intelligence, machine learning, and robotics. Other Fields: Language Teaching Assistantships: Teach English as a second language or other foreign languages to fellow students or community members. Community Service Projects: Volunteer with non-profit organizations and social enterprises to address community needs and promote social impact. Environmental Sustainability Initiatives: Participate in environmental conservation efforts, sustainable development projects, and green initiatives. Requirements: Enrollment in a recognized educational institution in the UAE, either at the undergraduate or graduate level. Valid student visa or residency permit allowing for study and work privileges in the UAE. Excellent academic standing and commitment to academic excellence. Strong interpersonal, communication, and teamwork skills. Adaptability and willingness to embrace cultural diversity and navigate cross-cultural environments. Compliance with UAE regulations and laws governing student employment and residency. Benefits: Opportunity to gain practical work experience and develop professional skills while studying. Access to a diverse range of employment opportunities across various sectors of the UAE economy. Exposure to multicultural environments and networking opportunities with professionals from around the world. Supportive academic and career advising services to help you achieve your educational and career goals. Potential for long-term career prospects and pathways to permanent residency or employment in the UAE upon graduation. If you are a motivated and ambitious international student seeking an enriching study and work experience in the UAE, we invite you to join us in pursuing academic excellence and professional development. Explore the diverse opportunities available and embark on a rewarding journey of learning, growth, and success in the vibrant and dynamic environment of the UAE. Apply now and unlock your full potential with us! Show more Show less Seniority level Not Applicable Employment type Full-time Job function Education, Research, and Training Industries Higher Education, Education Administration Programs, and Education Referrals increase your chances of interviewing at Business Umbrella - Recruitment, Training, Consulting, Licensing Healthcare Education Real estate by 2x See who you know","24":"Frontend Developer Wipro Sofia, Sofia City, Bulgaria 2 hours ago Be among the first 25 applicants See who Wipro has hired for this role Apply Save Report this job Requirements and Skills: Proven hands-on Software Development experience Proven working experience in Java development Proficiency in Java, with a good understanding of its ecosystems Experience in designing and developing applications using Java EE platforms Working knowledge of SQL and ORM technologies (JPA2, Hibernate) Experience in the Spring Framework Familiarity with RESTful APIs and web services Deep knowledge of JS (ES6+) Proficiency in HTML \/ CSS, including advanced practices (semantic HTML and Accessibility) TypeScript and React hands-on experience Experience with CSS-in-JS libraries or preprocessors (Styled Components, SCSS, css modules, tailwind) Familiarity with build tools such as Maven or Gradle. Experience with version control systems like Git. Understanding of Agile methodologies Understanding of microservices architecture and design principles. Responsibilities: Design and develop high-volume, low-latency applications for mission-critical systems, delivering high availability and performance. Write well-designed, testable, and efficient code. Ensure that designs are in compliance with specifications. Contribute to all phases of the development lifecycle. Maintain existing software systems by identifying and correcting software defects. Monitor and support production applications. Work closely with business analysts and project managers to understand requirements and translate them into technical specifications. Collaborate with other developers to design and implement features. Participate in code reviews to ensure code quality and adherence to standards. Continuously discover, evaluate, and implement new technologies to maximize development efficiency. Propose improvements to existing software processes and tools. Show more Show less Seniority level Not Applicable Employment type Contract Job function Information Technology Industries IT Services and IT Consulting Referrals increase your chances of interviewing at Wipro by 2x See who you know","32":"(Junior) Analytics Developer - SAP Cloud Apps & Analytics Team SAP Sofia, Sofia City, Bulgaria 3 days ago 26 applicants See who SAP has hired for this role Apply Join or sign in to find your next job Join to apply for the (Junior) Analytics Developer - SAP Cloud Apps & Analytics Team role at SAP Not you? Remove photo First name Last name Email Password (6+ characters) ,  ,  .   Already on LinkedIn? Sign in Save Report this job Use AI to assess how you fit Get AI-powered advice on this job and more exclusive features. Am I a good fit for this job? Tailor my resume Sign in to access AI-powered advices Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to evaluate your skills Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to tailor your resume Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . We help the world run better At SAP, we enable you to bring out your best. Our company culture is focused on collaboration and a shared passion to help the world run better. How? We focus every day on building the foundation for tomorrow and creating a workplace that embraces differences, values flexibility, and is aligned to our purpose-driven and future-focused work. We offer a highly collaborative, caring team environment with a strong focus on learning and development, recognition for your individual contributions, and a variety of benefit options for you to choose from. What you`ll do: At CLM AM Apps and Analytics Team, our mission is to support the fast-growing SAP cloud, with a large set of (customer-facing) cloud-based applications and analytical content. To strengthen our team further and accommodate SAP’s growth in the cloud, we are looking for a (Junior) Developer to join our Team. As a (Junior) Developer within the CLM AM Apps and Analytics Team you take over accountability for excellent execution of SAP’s Cloud strategy. You will work with the latest technology towards reporting & data analysis. You will be handling the full development cycle, from discussing requirements with our (internal) customers, to design, architecture, implementation, bug fixing and troubleshooting. The Role In your role as (Junior) Developer, you will work closely with international colleagues together on development projects with the following activities: Design appealing and sustainable solutions for analytical purposes. Optimize and simplify existing reports and code. Perform agile prototyping to evaluate which solution fits best for cloud operations. Data ingestion and data management. Master the “full stack” from UI over backend to database. Dig into SAP´s cloud business and collaborate closely with stakeholder from SAP´s cloud business. What You Bring 2+ years of programming experience Fundamental knowledge in object-oriented Programming is a must. Basic knowledge of design patterns. ABAP is a plus. Well-founded knowledge of SQL \/ database development is a must. This includes analysis & optimization of DB queries. Knowledge of fundamental web technologies, like OData, http, SOAP, XML, REST is a plus. Experience in test-driven development as well as model-driven development Basic knowledge of system configuration and administration Strong open-minded communication and presentation skills for stakeholder management and end-user support Language: English fluent is must Optional: Meet your team: We have highly talented, skilled, and motivated diverse team members. Your home-zone and core-team will be in the brand-new SAP Labs Dresden and we ae growing at SAP Labs Sofia Bring out your best SAP innovations help more than four hundred thousand customers worldwide work together more efficiently and use business insight more effectively. Originally known for leadership in enterprise resource planning (ERP) software, SAP has evolved to become a market leader in end-to-end business application software and related services for database, analytics, intelligent technologies, and experience management. As a cloud company with two hundred million users and more than one hundred thousand employees worldwide, we are purpose-driven and future-focused, with a highly collaborative team ethic and commitment to personal development. Whether connecting global industries, people, or platforms, we help ensure every challenge gets the solution it deserves. At SAP, you can bring out your best. We win with inclusion SAP’s culture of inclusion, focus on health and well-being, and flexible working models help ensure that everyone – regardless of background – feels included and can run at their best. At SAP, we believe we are made stronger by the unique capabilities and qualities that each person brings to our company, and we invest in our employees to inspire confidence and help everyone realize their full potential. We ultimately believe in unleashing all talent and creating a better and more equitable world. SAP is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to the values of Equal Employment Opportunity and provide accessibility accommodations to applicants with physical and\/or mental disabilities. If you are interested in applying for employment with SAP and are in need of accommodation or special assistance to navigate our website or to complete your application, please send an e-mail with your request to Recruiting Operations Team: Careers@sap.com For SAP employees: Only permanent roles are eligible for the SAP Employee Referral Program, according to the eligibility rules set in the SAP Referral Policy. Specific conditions may apply for roles in Vocational Training. EOE AA M\/F\/Vet\/Disability Qualified applicants will receive consideration for employment without regard to their age, race, religion, national origin, ethnicity, age, gender (including pregnancy, childbirth, et al), sexual orientation, gender identity or expression, protected veteran status, or disability. Successful candidates might be required to undergo a background verification with an external vendor. Requisition ID: 395583 | Work Area: Software-Design and Development | Expected Travel: 0 - 10% | Career Status: Professional | Employment Type: Regular Full Time | Additional Locations: . Show more Show less Seniority level Not Applicable Employment type Full-time Job function Research and Design Industries Software Development, IT Services and IT Consulting, and Business Consulting and Services Referrals increase your chances of interviewing at SAP by 2x See who you know","6":"Junior Python Developer euNetworks Sofia City, Bulgaria 5 days ago 35 applicants See who euNetworks has hired for this role Apply Join or sign in to find your next job Join to apply for the Junior Python Developer role at euNetworks Not you? Remove photo First name Last name Email Password (6+ characters) ,  ,  .   Already on LinkedIn? Sign in Save Report this job The Role We are looking for a Junior Python Developer to our team based in Sofia. You will be developing on a Python based platform that enables euNetworks to activate end-to-end customer services with no intervention from operational teams. The platform is integrated with Salesforce APIs to pass requests and outcomes to the network, configuring, de-configuring and updating routers in the network. Cloud Service providers are a key part of the existing integration with several already having been automated through the platform – Azure, AWS, Google, Oracle and IBM. Open Source automation tools are a key part of the architecture and you will be responsible overall for the extension of functionalities and overall design of the software. What will you be doing? Develop and maintain network automation software, including comprehensive documentation, version control, and repository management. Collaborate with the Salesforce development team to design and implement interfaces between Salesforce (SFDC) and live network platforms. Evaluate and integrate third-party network automation tools with existing euNetworks systems. Ensure adherence to ISMS secure development practices and organizational standards. You will be reporting into the Director for Digital Enablement and be part of an Agile team of 5 people (aside you, 3 mid\/senior developers and 1 business analyst). What do we want from you? BSc\/MSc in Computer Science or other relevant fields (optional). Some experience in Python, regular expressions, and scripting languages (e.g., Bash, TCL, Expect). Experience with SOAP and REST API development. Understanding of networking and databases; familiarity with automation tools such as Ansible, Puppet, Chef, or Salt is desirable. Strong analytical, creative, and troubleshooting skills. If this position is of interest but you don’t think you meet all of the criteria listed, please consider applying still. euNetworks looks to recruit people with the right attitude, potential and ambition and for the right candidate, we will provide further training and support to enable you to develop in the role. Show more Show less Seniority level Associate Employment type Full-time Job function Information Technology Industries Telecommunications Referrals increase your chances of interviewing at euNetworks by 2x See who you know","35":"Junior Salesforce Engineer SoftServe Bulgaria 2 weeks ago Be among the first 25 applicants See who SoftServe has hired for this role Apply Join or sign in to find your next job Join to apply for the Junior Salesforce Engineer role at SoftServe Not you? Remove photo First name Last name Email Password (6+ characters) ,  ,  .   Already on LinkedIn? Sign in Save Report this job Use AI to assess how you fit Get AI-powered advice on this job and more exclusive features. Am I a good fit for this job? Tailor my resume Sign in to access AI-powered advices Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to evaluate your skills Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to tailor your resume Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . WE ARE SoftServe is a global digital solutions company, headquartered in Austin, Texas, founded in 1993. Our associates work on 2,000+ projects with clients in the USA, Europe, LATAM, and APAC. We are about people who create bold things, make a difference, have fun, and love their work. Our Salesforce Center of Excellence (CoE) is a dynamic team of over 90 architects, engineers, consultants, and quality control specialists dedicated to Salesforce excellence. We deliver end-to-end Salesforce solutions, from pre-sales support and architecture planning to full-scale implementation and post-deployment support. IF YOU ARE A Salesforce engineer with at least 1 year of hands-on experience Skilled with Service Cloud Competent in solutions development using sync\/async Apex, REST API and SOAP, LWC, and Aura frameworks Proficient in using SOQL and SOSL, custom settings, and custom metadata types Experienced in applying refactoring techniques, understanding integration best practices, and code optimization, CI\/CD usage Certified as Salesforce Developer 1, and, ideally, Salesforce Developer 2 or JavaScript Developer AND YOU WANT TO Develop and implement new functionality, extensions, and customizations of Salesforce platform and products Analyze and review business, functional, and technical requirements Lead mid-complexity development projects and handle integrations Implement custom business logic using Apex patterns and tools Mentor trainee developers and support code reviews for quality assurance TOGETHER WE WILL Be a part of an innovative team that drives digital transformation and empowers clients worldwide Explore a universe of knowledge with access to 11,300+ learning solutions through SoftServe University and Udemy Business Enroll in our Mentoring Program to connect with experienced mentors who will foster your personal and professional growth Benefit from a comprehensive health insurance package that cares for your wellness Engage in continuous learning and development opportunities tailored to your growth Experience a supportive work culture that encourages innovation and creativity SoftServe is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment regardless of race, color, religion, age, sex, nationality, disability, sexual orientation, gender identity and expression, veteran status, and other protected characteristics under applicable law. Let’s put your talents and experience in motion with SoftServe Show more Show less Seniority level Entry level Employment type Full-time Job function Information Technology, Consulting, and Engineering Industries IT Services and IT Consulting Referrals increase your chances of interviewing at SoftServe by 2x See who you know","15":"(Junior to Mid) Backend Developer for Open-Source SAP Sofia, Sofia City, Bulgaria 2 days ago 25 applicants See who SAP has hired for this role Apply Join or sign in to find your next job Join to apply for the (Junior to Mid) Backend Developer for Open-Source role at SAP Not you? Remove photo First name Last name Email Password (6+ characters) ,  ,  .   Already on LinkedIn? Sign in Save Report this job We help the world run better At SAP, we enable you to bring out your best. Our company culture is focused on collaboration and a shared passion to help the world run better. How? We focus every day on building the foundation for tomorrow and creating a workplace that embraces differences, values flexibility, and is aligned to our purpose-driven and future-focused work. We offer a highly collaborative, caring team environment with a strong focus on learning and development, recognition for your individual contributions, and a variety of benefit options for you to choose from. The development center of SAP in Bulgaria plays a key role in the defining and developing of the SAP Business Technology Platform. With its more than 1400 professionals, SAP Labs Bulgaria also has strong contributions toward life-cycle management, user interface & user experience across the broader portfolio of SAP products and has recently welcomed new teams focusing on business applications. For its 24-year history, the company has established itself as a preferred employer in the IT sector in Bulgaria. What you`ll do The team provides Platform as a Service and embedded Core Services for Cloud Foundry (CF) Runtime of SAP Business Technology Platform (BTP). Developing, deploying and maintaining the corresponding services running in a cloud environment are core responsibilities of the team. The team believes and practices agile development methods, pair programming, Software Craftmanship, GitOps, Test-Driven-Development and works in an environment with Continuous Integration and Continuous Delivery. Monitoring and Observability are other core practices focused by the team. The Role In this role you will contribute to open source projects of the Cloud Foundry Foundation and ensure that BTP Cloud Foundry Platform is running reliable and stable. Being part of a highly motivated agile and self-managed team, you will care for code from your local machine to productive systems. You will learn and apply new concepts, processes, and modern open-source technologies. The daily tasks will imply close collaboration with teams all over the world within the company and the Cloud Foundry Community. What You Bring Bachelor's degree or higher in Computer Science or related field Knowledge in at least one programming language on Python, Golang or Shell Scripts Familiar with agile methods, test-driven development, continuous integration and continous delivery Experience developing Cloud Services topics Background in Linux (BASH), Networking (HTTP, DNS, TCP, OSI) and Databases (SQL) Preferably cloud development or distributed systems experience and Cloud Platforms (e.g. SAP Business Technology Platform, Amazaon Web Services, Azure, Google Cloud Platform, Alibaba Cloud) Very good English language skills (verbal and written), German skills are a plus DevOps experience in test framework (e.g. Ginkgo, Py-\/Unittest) and continuous integration tool (e.g. Jenkins, Concourse) is a plus Meet your team Within the team we count on self-motivation, continuous learning and helping each other, as well as on mentorship to ensure, that, especially new colleagues get up-to-speed as-soon-as-possible and at the same time can work on their own pace, which gives them flexibility to balance their professional and personal life. The collaborative nature of team enables you to continuously learn new technologies and adapt agile practice. We live the SAP cultures and celebrate successes, while having an open and constructive dialogue on continuous improvements, share knowledge and foster our team focus and team spirit. #SAPBTPEXCareers #SAPBulgariaLabsCareers #SAPTICareers #SAPBTPEXCareers, #SAPTICareers Bring out your best SAP innovations help more than four hundred thousand customers worldwide work together more efficiently and use business insight more effectively. Originally known for leadership in enterprise resource planning (ERP) software, SAP has evolved to become a market leader in end-to-end business application software and related services for database, analytics, intelligent technologies, and experience management. As a cloud company with two hundred million users and more than one hundred thousand employees worldwide, we are purpose-driven and future-focused, with a highly collaborative team ethic and commitment to personal development. Whether connecting global industries, people, or platforms, we help ensure every challenge gets the solution it deserves. At SAP, you can bring out your best. We win with inclusion SAP’s culture of inclusion, focus on health and well-being, and flexible working models help ensure that everyone – regardless of background – feels included and can run at their best. At SAP, we believe we are made stronger by the unique capabilities and qualities that each person brings to our company, and we invest in our employees to inspire confidence and help everyone realize their full potential. We ultimately believe in unleashing all talent and creating a better and more equitable world. SAP is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to the values of Equal Employment Opportunity and provide accessibility accommodations to applicants with physical and\/or mental disabilities. If you are interested in applying for employment with SAP and are in need of accommodation or special assistance to navigate our website or to complete your application, please send an e-mail with your request to Recruiting Operations Team: Careers@sap.com For SAP employees: Only permanent roles are eligible for the SAP Employee Referral Program, according to the eligibility rules set in the SAP Referral Policy. Specific conditions may apply for roles in Vocational Training. EOE AA M\/F\/Vet\/Disability Qualified applicants will receive consideration for employment without regard to their age, race, religion, national origin, ethnicity, age, gender (including pregnancy, childbirth, et al), sexual orientation, gender identity or expression, protected veteran status, or disability. Successful candidates might be required to undergo a background verification with an external vendor. Requisition ID: 402562 | Work Area: Software-Design and Development | Expected Travel: 0 - 10% | Career Status: Professional | Employment Type: Regular Full Time | Additional Locations: . Show more Show less Seniority level Not Applicable Employment type Full-time Job function Research and Design Industries Software Development, IT Services and IT Consulting, and Business Consulting and Services Referrals increase your chances of interviewing at SAP by 2x See who you know","17":"Software Engineer for Training AI Data (Python) G2i Inc. European Union 22 hours ago 104 applicants See who G2i Inc. has hired for this role Apply Join or sign in to find your next job Join to apply for the Software Engineer for Training AI Data (Python) role at G2i Inc. Not you? Remove photo First name Last name Email Password (6+ characters) ,  ,  .   Already on LinkedIn? Sign in Save Report this job Use AI to assess how you fit Get AI-powered advice on this job and more exclusive features. Am I a good fit for this job? Tailor my resume Sign in to access AI-powered advices Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to evaluate your skills Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to tailor your resume Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Accepted Locations We accept applicants from the US, Canada, and most countries in LATAM and Europe. We are accepting candidates from some countries in Africa and Asia. For the complete list of accepted locations , click here . This work is 100% remote. Loom Video Our Founder\/CEO, Gabe Greenberg , created a more in-depth Loom video that we highly recommend you watch! Check it out here: https:\/\/www.loom.com\/share\/5a8972c7fbbf46aaa3f389b2b6391c40 Overview You’ll join an expert annotation team to create training data for the world's most advanced AI models. No previous AI experience is necessary. You'll get your foot in the door with one of the most prominent players in the AI\/LLM space today. We seek software engineers with 3+ years of experience to train large AI language models, helping cutting-edge generative AI models write better code. Projects typically include discrete, highly variable problems that involve engaging with these models as they learn to code. We currently have 200+ roles open! What Will I Be Doing? Evaluating the quality of AI-generated code, including human-readable summaries of your rationale Solve coding problems, writing functional and efficient code Writing robust test cases to confirm code works efficiently and effectively We asked the technical project manager to go into even more detail and this is how he answered: It is solving coding challenges, creating instructions to help others, reviewing the code before it goes into the model, and there's a ton of variety in the projects. We have everything from \"Which piece of Golang code is better?\" to \"Make a full mobile application using this chatbot, and improve the chatbot's responses afterward to make it faster.\" Pay Rates Compensation rates vary based on location and experience. Note: The following rates are starting points and may be subject to change: To view the complete list of locations and their values, click here. US - 50\/hr Brazil - 25.40 USD \/hr Egypt - 14.60 USD \/hr Philippines - 24.20 USD \/hr Expectations are 15+ hours per week; however, there is no upper limit. We have engineers working 20-40 hours per week and some working 40+ hours per week. You can work as much as you want to. You'll get paid weekly per hour of work done on the platform. Contract Length Long term, there is no end date. They expect to have work for the next 2 years. You can end the contract at any time. We hope you will commit to 12 months of work, but if you start and it's not a fit for you, we totally understand. Flexible Schedules Developers can set their own hours—ideal candidates will be interested in spending 40 hours a week. They will be with teams, so strong performers will adapt to the urgency of projects and stay engaged, but they will also be incredibly flexible on working hours. You can take a 3-hour lunch, no problem. Instead of tracking your hours, you are paid according to time spent on the platform, calculated in the coding exercises. Interview Process Apply using this Ashby form. If you seem like a good fit, we'll send an async RLHF code review that will take 35 minutes and must be finished within 72 hours of us sending it. You'll receive credentials to the RLHF platform. We'll then set up a group call to answer any further questions about onboarding with the company. You'll perform a simulated production-level task (RLHF task) on the platform. This will be your final interview, which will ultimately determine your employment and leveling. Successful completion of this process provides you with an opportunity to work on projects as they become available. Tech Stack Priorities The current priority for this team is engineers with either a Data Science background who know Golang well or software engineers who are well versed in Golang. Required Qualifications: 3+ years of experience in a software engineering\/software development role. Complete fluency in the English language. Ability to articulate complex scientific concepts clearly and engagingly. Excellent attention to detail and ability to maintain consistency in writing. Solid understanding of grammar, punctuation, and style guidelines. Proficiency with Golang Nice To Haves: Bachelor's or Master’s degree in Computer Science Proficiency in working with one or more of the following: Java, JavaScript, TypeScript, C++. SQL, Swift, Ruby, Rust, Go, NET, Matlab, PHP, HTML, DART, R, Apex, and Shell, C, C# Recognized accomplishments or contributions to the coding community or in projects. Proven analytical skills with an ability to approach problems creatively. Adept communication skills, especially when understanding and discussing project requirements. A commitment to continuous learning and staying updated with the latest coding advancements and best practices. Enthusiasm for teaching AI models and experience with technical writing! Show more Show less Seniority level Entry level Employment type Contract Job function Information Technology Industries Software Development Referrals increase your chances of interviewing at G2i Inc. by 2x See who you know","16":"Competitive Coders for Training AI Data G2i Inc. EMEA 22 hours ago Over 200 applicants See who G2i Inc. has hired for this role Apply Join or sign in to find your next job Join to apply for the Competitive Coders for Training AI Data role at G2i Inc. Not you? Remove photo First name Last name Email Password (6+ characters) ,  ,  .   Already on LinkedIn? Sign in Save Report this job Use AI to assess how you fit Get AI-powered advice on this job and more exclusive features. Am I a good fit for this job? Tailor my resume Sign in to access AI-powered advices Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now Sign in to evaluate your skills Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now Sign in to tailor your resume Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now Accepted Locations We accept applicants from the US, Canada, and most countries in LATAM and Europe. We are accepting candidates from some countries in Africa and Asia. This work is 100% remote. Competitive Coders We're looking to engage engineers who are competitive coders and have attended at least one of the hackathons and competitions from this list. Loom Video Our Founder\/CEO, Gabe Greenberg , created a more in-depth Loom video that we highly recommend you watch! Check it out here: https:\/\/www.loom.com\/share\/5a8972c7fbbf46aaa3f389b2b6391c40 Overview You’ll join an expert annotation team to create training data for the world's most advanced AI models. No previous AI experience is necessary. You'll get your foot in the door with one of the most prominent players in the AI\/LLM space today. We seek software engineers with 3+ years of experience to train large AI language models, helping cutting-edge generative AI models write better code. Projects typically include discrete, highly variable problems that involve engaging with these models as they learn to code. We currently have 200+ roles open! What Will I Be Doing? Evaluating the quality of AI-generated code, including human-readable summaries of your rationale Solve coding problems, writing functional and efficient code Writing robust test cases to confirm code works efficiently and effectively We asked the technical project manager to go into even more detail and this is how he answered: It is solving coding challenges, creating instructions to help others, reviewing the code before it goes into the model, and there's a ton of variety in the projects. We have everything from \"Which piece of Python code is better?\" to \"Make a full mobile application using this chatbot, and improve the chatbot's responses afterward to make it faster.\" Pay Rates The worldwide rate for this project is $50\/hr. Expectations are 15+ hours per week; however, there is no upper limit. We have engineers working 20-40 hours per week and some working 40+ hours per week. You can work as much as you want to. You'll get paid weekly per hour of work done on the platform. Contract Length Long term, there is no end date. They expect to have work for the next 2 years. You can end the contract at any time. We hope you will commit to 12 months of work, but if you start and it's not a fit for you, we totally understand. Flexible Schedules Developers can set their own hours—ideal candidates will be interested in spending 40 hours a week. They will be with teams, so strong performers will adapt to the urgency of projects and stay engaged, but they will also be incredibly flexible on working hours. You can take a 3-hour lunch, no problem. Instead of tracking your hours, you are paid according to time spent on the platform, calculated in the coding exercises. Interview Process Apply using this Ashby form. If you seem like a good fit, we'll send an async RLHF code review that will take 35 minutes and must be finished within 72 hours of us sending it. You'll receive credentials to the RLHF platform. We'll then set up a group call to answer any further questions about onboarding with the company. You'll perform a simulated production-level task (RLHF task) on the platform. This will be your final interview, which will ultimately determine your employment and leveling. Successful completion of this process provides you with an opportunity to work on projects as they become available. Tech Stack Priorities The current priority for this team is engineers with either a Data Science background who know Python well or software engineers who are well versed in Python. Required Qualifications: 3+ years of experience in a software engineering\/software development role. Complete fluency in the English language. Ability to articulate complex scientific concepts clearly and engagingly. Excellent attention to detail and ability to maintain consistency in writing. Solid understanding of grammar, punctuation, and style guidelines. Proficiency with Python Nice To Haves: Bachelor's or Master’s degree in Computer Science Proficiency in working with one or more of the following: Java, JavaScript, TypeScript, C++. SQL, Swift, Ruby, Rust, Go, NET, Matlab, PHP, HTML, DART, R, Apex, and Shell, C, C# Recognized accomplishments or contributions to the coding community or in projects. Proven analytical skills with an ability to approach problems creatively. Adept communication skills, especially when understanding and discussing project requirements. A commitment to continuous learning and staying updated with the latest coding advancements and best practices. Enthusiasm for teaching AI models and experience with technical writing! Show more Show less Seniority level Associate Employment type Contract Job function Information Technology Industries Software Development Referrals increase your chances of interviewing at G2i Inc. by 2x See who you know","36":"Middle\/Senior DevOps Engineer (Sofia, Bulgaria) Onseo Bulgaria 23 hours ago Be among the first 25 applicants See who Onseo has hired for this role Apply Save Report this job Use AI to assess how you fit Get AI-powered advice on this job and more exclusive features. Am I a good fit for this job? Tailor my resume Sign in to access AI-powered advices Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to evaluate your skills Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to tailor your resume Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Direct message the job poster from Onseo Андрей Белан Андрей Белан IT Recruiter в компании Onseo We are looking for a Senior DevOps Engineer to join our team at the Bulgarian office of AUG Global. This position will be instrumental in designing, building, and maintaining the infrastructure for a new platform, ensuring it meets the highest standards of scalability, reliability, and security. Requirements: At least 5 years of experience in DevOps ; Cloud Platforms: strong expertise with Azure, including serverless applications, cloud security, and cloud architecture. Experience with other cloud solutions like AWS or GCP will be a plus. IaC & Automation: proficiency in Terraform or similar tools (e.g., Azure Resource Manager (ARM) Templates). Experience with other IaC solutions like AWS CloudFormation or Google Cloud Deployment Manager will be a plus. Experience with configuration management tools to automate server setup, configurations, and software deployment. CI\/CD: experience in building and managing CI\/CD pipelines for automated testing, build, and deployment processes. Monitoring & Incident Management: proficiency with tools like Grafana for system performance tracking, application health, and cloud infrastructure monitoring. Familiarity with incident management tools (e.g., PagerDuty). Security & Compliance: strong knowledge of cloud security principles, including access controls, RBAC, and identity management. Experience automating security checks in CI\/CD pipelines with tools like Snyk and SonarCube. Optimization: experience with scaling applications in cloud environments, including vertical and horizontal scaling, auto-scaling, and designing infrastructure for high availability and disaster recovery. Collaboration & Culture: experience in working within an Agile environment, collaborating with development, QA, and operations teams. Ability to contribute to a culture of shared responsibility and continuous improvement. Upper-intermediate level of English (spoken is a must) . Responsibilities: Ensure the smooth operation and effective management of the DevOps infrastructure; Oversee the management and maintenance of our cloud infrastructure to ensure high availability, scalability, and security; Develop and maintain Infrastructure as a Code (IaC) using Terraform (or similar tools) to automate provisioning and configuration of cloud resources; Quickly troubleshoot and resolve infrastructure, application, and deployment issues; Participate in the full software development and delivery cycle from concept to deployment; Design solutions and select technologies that solve the problems of our internal customers. We offer: Additional Health Insurance covering dental health; 24 days annual paid leave; We invest in your further education and certification; A small team in Sofia — we are focused on people growing fast in the company structure; Team buildings and office activities, a lot of memorable moments to come; Annual Wellbeing Allowance; Knowledgeable and friendly international team; Brand new office with everything brand new in it; Diversity of ongoing exciting projects; Humanity and trust are at the centre of our mentality; Transparent and open communication; Hybrid work mode. About the Project: Hard Rock is not just a world-renowned network of restaurants, casinos, and hotels, but also an innovative company that is constantly moving forward by implementing cutting-edge technologies to enhance the experience of its guests. Currently, Hard Rock is actively undergoing a digital transformation, building a new data platform from scratch that will serve as the foundation for the company’s future development. This platform will be integrated with business applications and will not only support analytics but also drive decisions based on data regarding the content shown to customers and help determine which products and services to offer. Show more Show less Seniority level Mid-Senior level Employment type Full-time Job function Engineering and Information Technology Industries IT Services and IT Consulting Referrals increase your chances of interviewing at Onseo by 2x See who you know","29":"AEM Full-Stack Software Developer (m\/f\/d) Sofia diva-e Sofia, Sofia City, Bulgaria 16 hours ago Be among the first 25 applicants See who diva-e has hired for this role Apply Join or sign in to find your next job Join to apply for the AEM Full-Stack Software Developer (m\/f\/d) Sofia role at diva-e Not you? Remove photo First name Last name Email Password (6+ characters) ,  ,  .   Already on LinkedIn? Sign in Save Report this job Use AI to assess how you fit Get AI-powered advice on this job and more exclusive features. Am I a good fit for this job? Tailor my resume Sign in to access AI-powered advices Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to evaluate your skills Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to tailor your resume Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Do you like to develop software solutions in the backend? Are you passionate about your job? An appreciative corporate culture and collegial cohesion are important to you? Then welcome to diva-e! To strengthen our team, we are looking for you as AEM Full-Stack Software Developer Together with a diverse team of CMS and application developers, UX and UI, SCRUM coach and product owner, you will drive the implementation of sophisticated CMS solutions and help our customers to present their brand online in the best possible way with AEM. We mainly use Java technologies in development. Your preferred location isn't listed? No matter if you live in the countryside or in another city – we'll find a solution. With us, you have the option to work remotely from anywhere in Bulgaria. About The Job Design and build backend components for Adobe Experience Manager (AEM), including templates, components, and OSGi services. Develop and maintain frontend components using TypeScript, leveraging frameworks like React or Vue, and tools like Redux or MobX for state management. Optimize web applications for performance, responsiveness, cross-browser compatibility, and strong SEO using tools like WebPack or Vite. Enhance existing AEM workflows, permissions, and integrate with marketing tools such as AEM Analytics. Collaborate closely with UX teams to ensure seamless UI integration, adhering to accessibility standards and WCAG 2.1 guidelines. Share knowledge within the team while contributing to a structured development workflow using Git, Jira\/Confluence, and other agile methodologies. Requirements Strong experience with AEM, including templates, components, OSGi services, Sling, and Felix. Proficiency in TypeScript, SCSS (preferred over CSS), and semantic HTML. Hands-on experience with Web Components and related tools like templating with Lit. Proficiency in frontend and backend testing frameworks (e.g., Jest or JUnit). Experience with design systems like StoryBook and tools such as Figma or InVision for translating UI into functional components. Strong communication skills, commitment to continuous learning, and ability to deliver results in agile teams; About us diva-e is Germany’s leading Transactional Experience Partner (TXP) who is on the mission to create digital experiences that will encourage customers to drive forward the digital transformation. With the concentrated experience of over 20 years, we realise e-business solutions for customers such as FC Bayern München, Carl Zeiss, EDEKA, E.ON, Lieferando and Ravensburger. At our offices in Germany, Bulgaria and the US around 900 employees are shaping the future of the digital business either in-house, remote or at our customers' sites. We are indeed proud of our corporate culture. Respect, trust, and empowerment are key aspects in our teams, that goes beyond the workplace. diva-e is proud to be an equal opportunity employer, and we are committed to hiring, promoting, and compensating employees based on their qualifications and demonstrated ability to perform job responsibilities. Show more Show less Seniority level Entry level Employment type Full-time Job function Engineering and Information Technology Industries IT Services and IT Consulting Referrals increase your chances of interviewing at diva-e by 2x See who you know","18":"Mathematics - AI trainer micro1 EMEA 17 hours ago Over 200 applicants See who micro1 has hired for this role Apply Join or sign in to find your next job Join to apply for the Mathematics - AI trainer role at micro1 Not you? Remove photo First name Last name Email Password (6+ characters) ,  ,  .   Already on LinkedIn? Sign in Save Report this job Use AI to assess how you fit Get AI-powered advice on this job and more exclusive features. Am I a good fit for this job? Tailor my resume Sign in to access AI-powered advices Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to evaluate your skills Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to tailor your resume Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . About Us: At micro1, we’re all about connecting skilled remote professionals with some of the best companies in Silicon Valley. Our mission is to offer a stable, competitive income, along with access to top industry opportunities—all in a flexible work setting with a range of great benefits. We’re here to help you grow in your career. We're proud to work with trusted partners such as Deel, Immutable, O’Gara, and LegalSoft. Job Description: We are seeking a passionate and highly knowledgeable Math Specialist to join our team in training AI models. This role is ideal for individuals with a strong foundation in Mathematics who are interested in utilizing their core expertise to contribute to AI. No prior experience in AI model training is required; we are looking for someone with deep subject matter knowledge, analytical skills, and the ability to apply Math principles to train sophisticated AI models. Key Responsibilities: Apply core Math knowledge to curate and prepare data for AI training. Collaborate with AI and data science teams to ensure that training materials are accurate and effective. Assist in analyzing and interpreting model outputs, ensuring the AI behaves according to expectations. Conduct research and contribute domain-specific insights to improve model performance. Provide constructive feedback on the AI’s understanding of key concepts within your expertise. Work closely with developers and subject matter experts to refine the model’s behavior and capabilities. Qualifications: Strong analytical and problem-solving skills. Proficiency in data analysis and a deep understanding of scientific or engineering principles. Effective communication skills, with an ability to explain complex concepts clearly. Willingness to learn and adapt to new AI technologies and tools. Preferred Skills: Experience in any field, either in academia or industry. A keen interest in artificial intelligence and a desire to understand how AI can be applied to real-world problems. Ability to work both independently and as part of a multidisciplinary team. Show more Show less Seniority level Mid-Senior level Employment type Full-time Job function Information Technology Industries IT Services and IT Consulting Referrals increase your chances of interviewing at micro1 by 2x See who you know","14":"Junior Website Developer Rotate Digital European Economic Area 3 days ago Over 200 applicants See who Rotate Digital has hired for this role Apply Join or sign in to find your next job Join to apply for the Junior Website Developer role at Rotate Digital Not you? Remove photo First name Last name Email Password (6+ characters) ,  ,  .   Already on LinkedIn? Sign in Save Report this job Use AI to assess how you fit Get AI-powered advice on this job and more exclusive features. Am I a good fit for this job? Tailor my resume Sign in to access AI-powered advices Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to evaluate your skills Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to tailor your resume Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . About the role At Rotate Digital, a Website Developer will be responsible for designing, building, and optimizing websites to maximize their visibility and ranking on search engines. This role combines web development skills with the ability to work closely with SEO specialists to create websites that drive organic traffic and deliver superior user experiences. The website developer will also be responsible for continual updates and optimization of client websites. This is a remote position and will require a website developer that is disciplined in time management and self-driven! This is a remote role with flexible working hours. You are free to work when you choose but we ask all employees outside of the USA to be available for communication and ready for last-minute urgent requests\/ meetings when necessary at anytime between 9 am - 3 pm US Eastern time. People who are a good fit for this role... Are fully comfortable with custom development in the Wordpress ecosystem (aka not dependent on pagebuilders) Have experience with Twig Template Engine & Timber engines Able to integrate various CRMs, chat features, and other tools into clients' websites without jeopardizing the performance and loading speed of the website Capabilities that you should possess: Technically Proficient Knowledge of HTML, JavaScript, PHP, etc. Ability to develop websites that translate well on various devices and screen sizes Able to integrate various CRMs, chat features, and other tools into clients' websites for enhancing functionality, improving user engagement, and streamlining business operations Initiative Exploring new technologies and practices that would enhance our websites and sharing with the team Ability to ask for help if roadblocks arise, or when something is unclear or unknown Ability to foresee and then execute on potential problems during a build or QA Time-Management Ability to balance website builds, ad-hoc tickets and other special projects for on-time delivery Drive To do whatever it takes to accomplish the desired outcome. Whether it’s a crunch of a timeline, or an additional mile that you can go to make a difference, this is a welcomed opportunity for you To take ownership of websites as our department’s product and continuously making our product better for our clients Strong Problem-Solving Skills Ability to analyze complex problems, identify the root cause, and come up with effective solutions quickly. We work collaboratively, but you are expected to be able to work autonomously and not need hand-holding on non-critical issues Code Review and Quality Assurance Ensure high-quality code through rigorous code reviews, manual testing, and development best practices Documentation Ability to create and maintain comprehensive documentation for code, APIs, and systems to ensure knowledge sharing and ease of maintenance in a remote and asynchronous team Understanding of Systems Architecture You have a strong understanding of systems architecture and WordPress design. You participate in preserving the quality of existing websites and writing quality code and structure for website improvements and new websites Duties Core activities or tasks to be performed daily, weekly, monthly, and\/or quarterly Website Development: Develop, maintain, and enhance websites and web applications, ensuring they are responsive, user-friendly, and aligned with Rotate Digital website development standards and best practices. Website Maintenance: Complete ad-hoc requests and optimizations for live websites to ensure client satisfaction and quality website performance. Quality Assurance: Implement and enforce testing processes, including unit testing and code reviews, to maintain code quality and security. Continuous Learning: Stay up-to-date with emerging web technologies and trends, and share knowledge with the team to drive innovation. Collaborative Department Development: We have a strong team of developers who like to tackle projects, improve processes, and better the quality of our websites together. Time-Tracking : Time spent on all tasks, projects, and builds needs to be tracked in order to help provide clarity to resources spent on projects\/clients and to help management better understand project workload and capacity. Cross-Department Communication: Clearly communicate with fellow team members from other departments. Questions are responded to within 24 hours, and any tasks assigned are acknowledged within 24 hours and if there is a conflict of time constraint, then this is communicated upfront. What's in it for you? Salary This role will be salaried at $800-$1,400 (depending on experience) with a review of the salary structure, bonus opportunities, and all other pay factors after 6 months. Show more Show less Seniority level Entry level Employment type Full-time Job function Design, Information Technology, and Marketing Industries Advertising Services Referrals increase your chances of interviewing at Rotate Digital by 2x See who you know","34":"Java Developer Nexo Careers Sofia City, Bulgaria 1 day ago Be among the first 25 applicants See who Nexo Careers has hired for this role Apply Join or sign in to find your next job Join to apply for the Java Developer role at Nexo Careers Not you? Remove photo First name Last name Email Password (6+ characters) ,  ,  .   Already on LinkedIn? Sign in Save Report this job Direct message the job poster from Nexo Careers Sonya Georgieva Sonya Georgieva Senior IT Recruitment Consultant Stand out and drive the next generation of wealth. ​Define the digital assets industry. Raise the bar for trust, transparency, and client success. Make your mark. Nexo is a premier digital assets wealth platform designed to empower clients to grow, manage, and preserve their crypto holdings. Our mission is to lead the next generation of wealth creation by focusing on customer success and delivering tailored solutions that build enduring value, supported by 24\/7 client care. Since 2018, Nexo has provided unmatched opportunities to forward-thinking clients in over 200 jurisdictions. With over $7 billion in AUM and $320 billion processed, we bring lasting value to millions worldwide. Our all-in-one platform combines advanced technology with a client-first approach, offering high-yield flexible and fixed-term savings, crypto-backed loans, sophisticated trading tools, and liquidity solutions, including the first crypto debit\/credit card. Built on deep industry expertise, a sustainable business model, robust infrastructure, stringent security, and global licensing, Nexo champions innovation and long-lasting prosperity. Official website: nexo.com Your role: Produce software, service design, and implementation for distributed systems. You Write It – You Own It: Develop, test, deploy, maintain, and improve – own the full life-cycle of your code. Develop back-end components and services of Nexo’s platform. Develop applications using Java, Kafka, micro-services, and AWS. Maintain a well-tested codebase with continuous integration and coverage reporting. Optimize for maximum speed and scalability. Work in small, autonomous teams with short-release cycles. Share your knowledge and help the team evolve best practices. What makes you stand out: 2 + years of work experience in developing software using Java and Spring Boot. Good knowledge of relational databases (MySQL, PostgreSQL, etc.). Good understanding of modern cloud environments (AWS, Azure, Google Cloud). Good apprehension of microservice architecture. Strong knowledge of Java and experience with Java EE Frameworks or Spring\/Spring Boot or other high-level language. Experience with document-oriented databases and key-value stores such as MongoDB, Elasticsearch, Memcached, Redis, DynamoDB. Desired (but not essential): Work experience with Terraform and Kubernetes. Experience with event streaming platforms and messaging brokers such as Apache Kafka, RabbitMQ, Amazon SQS. Experience working with wide-column stores such as Apache Cassandra. Knowledge of an additional scripting language such as PHP, Node.js, Python. Good familiarity with domain-driven design. Nexo benefits: Competitive and rewarding remuneration package. Annual performance-based bonuses. Comprehensive Learning Hub for continuous growth. Hybrid work model: primarily office-based with scheduled home office flexibility. A dynamic and inspiring environment with cutting-edge projects. Career development opportunities in a global leader driving the next generation of wealth. Customizable personal benefits package.Wellness benefits include additional health insurance, all-access sports cards, team-wide sports activities, standing desks, and blue light glasses. Free parking with a designated space, free electric bikes, and public transportation cards. Fresh fruits, snacks, and a well-stocked office kitchen. Regular department team buildings and company-wide team buildings. Show more Show less Seniority level Mid-Senior level Employment type Full-time Job function Information Technology Industries Banking Referrals increase your chances of interviewing at Nexo Careers by 2x See who you know","13":"Junior BI Developer DSK Bank Sofia, Sofia City, Bulgaria 2 weeks ago Be among the first 25 applicants See who DSK Bank has hired for this role Apply Save Report this job Use AI to assess how you fit Get AI-powered advice on this job and more exclusive features. Am I a good fit for this job? Tailor my resume Sign in to access AI-powered advices Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to evaluate your skills Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to tailor your resume Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Direct message the job poster from DSK Bank Albena Tasheva Albena Tasheva Human Resources Expert at DSK Bank Junior BI Developer At DSK Bank, we are seeking a motivated Junior Business Intelligence Developer to join our dynamic team. This role will provide the right candidate with an opportunity to grow their skills in business intelligence and data analysis, while contributing to our company's data-driven approach to decision making. Main Responsibilities: ·  Design and develop effective business intelligence dashboards using Power BI, focusing on clear and informative data visualization techniques to communicate insights to stakeholders; ·  Analyze complex data sets to identify trends, patterns, and relationships relevant to visualizations. Translate these insights into clear and actionable stories for audiences through data visualization; ·  Partner with business stakeholders to understand their needs and objectives. Translate those needs into compelling data visualizations that effectively communicate insights; ·  Prepare data for visualization by wrangling and cleaning datasets from Oracle databases. Write SQL queries to extract relevant data for visualizations; Ideal Candidate: Education: Bachelor's degree in Computer Science, Information Systems, or a related field; Experience: Proven experience in data visualization, business intelligence (BI) development, data science, or a relevant role involving data management; Technical Skills: Hands-on experience with BI technologies, specifically Power BI. Writing SQL queries, particularly for Oracle databases, is a strong advantage; Soft Skills: Strong problem-solving skills and a meticulous eye for detail. Ability to thrive in a collaborative team environment. Excellent communication and interpersonal skills to effectively translate data insights to stakeholders; We offer: Excellent opportunities for professional and career development in one of Bulgaria’s leading banks; Food vouchers in the amount of 200 BGN per month; 20 + 5 paid holiday leave; Additional Health Insurance; Favorable conditions for housing and mortgage lending, as well as for bank products and services; Preferences for bank products and services; Annual bonus scheme depending on the achieved results; Preferential conditions for Multisport \/ CoolFit card; Great location – in the heart of Sofia’s city center; Discounts in various companies; Refer a Friend Bonus. If you are looking for a career where you can apply your passion for data, grow your skills, and contribute to the success of a leading bank, we would love to hear from you! Only shortlisted candidates will be contacted. All applications will be treated in strict confidentiality. Show more Show less Seniority level Entry level Employment type Full-time Job function Information Technology Industries Banking Referrals increase your chances of interviewing at DSK Bank by 2x See who you know"},"company":{"8":"Luxoft Bulgaria","26":"Owen Thomas | Pending B Corp™","30":"Luxoft","9":"SAP","7":"Accedia","23":"SELIUK LTD","0":"IBM","27":"Qinlox Consulting","11":"Shkolo","22":"micro1","19":"ICT Strypes","10":"Canonical","20":"EPAM Systems","5":"DXC Technology","28":"YO IT CONSULTING","25":"SoftServe","31":"ICT Strypes","2":"DXC Technology","12":"Smartsheet","3":"Dreamix","4":"LimeChain - Blockchain & Web3 Solutions","1":"Trading 212","33":"Nexo Careers","21":"Business Umbrella - Recruitment, Training, Consulting, Licensing Healthcare Education Real estate","24":"Wipro","32":"SAP","6":"euNetworks","35":"SoftServe","15":"SAP","17":"G2i Inc.","16":"G2i Inc.","36":"Onseo","29":"diva-e","18":"micro1","14":"Rotate Digital","34":"Nexo Careers","13":"DSK Bank"},"job-title":{"8":"Junior C++ Developer","26":"Back End Developer, Algorithms\/Data Structures, GoLang | Crypto Exchange, Scale up | Salary Range $100,000-$130,000 Base + Stock Options + Benefits (Fully Remote)","30":"Junior\/Regular C++ Developer","9":"Junior Developer - SAP Next Talent Program","7":"Junior .NET Developer","23":"Lead Python Software Engineer","0":"Junior Software Developer","27":"Junior SAP ABAP Developer","11":"Junior Full Stack PHP Developer","22":"Machine Learning Engineer","19":"Python Developer","10":"Graduate\/Associate Software Engineer - Build & Release Infrastructure","20":"Middle Java Software Engineer","5":"Junior Data Engineer","28":"Python Developer - LLM","25":"Middle Java Software Engineer","31":"Python Developer","2":"Junior Python Developer","12":"Software Engineer I (Remote Eligible in Bulgaria)","3":"Junior Java Engineer","4":"Junior Backend Developer","1":"Junior Software Engineer","33":"Software Architect","21":"Bachelor\/ Masters pursuing Student - Study  Opportunity in the UAE","24":"Frontend Developer","32":"(Junior) Analytics Developer - SAP Cloud Apps & Analytics Team","6":"Junior Python Developer","35":"Junior Salesforce Engineer","15":"(Junior to Mid) Backend Developer for Open-Source","17":"Software Engineer for Training AI Data (Python)","16":"Competitive Coders for Training AI Data","36":"Middle\/Senior DevOps Engineer (Sofia, Bulgaria)","29":"AEM Full-Stack Software Developer (m\/f\/d) Sofia","18":"Mathematics - AI trainer","14":"Junior Website Developer","34":"Java Developer","13":"Junior BI Developer"},"level":{"8":"Associate","26":"Mid-Senior level","30":"Mid-Senior level","9":"Not Applicable","7":"Entry level","23":"Mid-Senior level","0":"Entry level","27":"Entry level","11":"Entry level","22":"Mid-Senior level","19":"Mid-Senior level","10":"Entry level","20":"Associate","5":"Entry level","28":"Mid-Senior level","25":"Associate","31":"Mid-Senior level","2":"Entry level","12":"Entry level","3":"Entry level","4":"Entry level","1":"Entry level","33":"Mid-Senior level","21":"Not Applicable","24":"Not Applicable","32":"Not Applicable","6":"Associate","35":"Entry level","15":"Not Applicable","17":"Entry level","16":"Associate","36":"Mid-Senior level","29":"Entry level","18":"Mid-Senior level","14":"Entry level","34":"Mid-Senior level","13":"Entry level"},"location":{"8":"Sofia, Sofia City, Bulgaria","26":"European Union","30":"Sofia, Sofia City, Bulgaria","9":"Sofia, Sofia City, Bulgaria","7":"Sofia, Sofia City, Bulgaria","23":"Bulgaria","0":"Sofia, Sofia City, Bulgaria","27":"Sofia, Sofia City, Bulgaria","11":"Sofia, Sofia City, Bulgaria","22":"EMEA","19":"Sofia, Sofia City, Bulgaria","10":"Sofia, Sofia City, Bulgaria","20":"Bulgaria","5":"Bulgaria","28":"Bulgaria","25":"Bulgaria","31":"Bulgaria","2":"Sofia, Sofia City, Bulgaria","12":"Bulgaria","3":"Sofia, Sofia City, Bulgaria","4":"Sofia Metropolitan Area","1":"Sofia, Sofia City, Bulgaria","33":"Sofia, Sofia City, Bulgaria","21":"EMEA","24":"Sofia, Sofia City, Bulgaria","32":"Sofia, Sofia City, Bulgaria","6":"Sofia City, Bulgaria","35":"Bulgaria","15":"Sofia, Sofia City, Bulgaria","17":"European Union","16":"EMEA","36":"Bulgaria","29":"Sofia, Sofia City, Bulgaria","18":"EMEA","14":"European Economic Area","34":"Sofia City, Bulgaria","13":"Sofia, Sofia City, Bulgaria"},"posted-time-ago":{"8":"4 weeks ago","26":null,"30":"4 weeks ago","9":"2 weeks ago","7":"9 months ago","23":null,"0":"1 week ago","27":"1 year ago","11":"6 days ago","22":null,"19":null,"10":"3 weeks ago","20":null,"5":"2 weeks ago","28":"4 months ago","25":null,"31":null,"2":"3 months ago","12":"3 weeks ago","3":"3 weeks ago","4":"3 weeks ago","1":"1 week ago","33":"1 day ago","21":null,"24":null,"32":"3 days ago","6":"5 days ago","35":"2 weeks ago","15":"2 days ago","17":null,"16":null,"36":null,"29":null,"18":null,"14":"3 days ago","34":"1 day ago","13":"2 weeks ago"},"nb_candidats":{"8":29.0,"26":53.0,"30":null,"9":56.0,"7":196.0,"23":null,"0":41.0,"27":null,"11":null,"22":109.0,"19":null,"10":null,"20":null,"5":null,"28":33.0,"25":null,"31":50.0,"2":null,"12":null,"3":null,"4":174.0,"1":null,"33":null,"21":52.0,"24":null,"32":26.0,"6":35.0,"35":null,"15":25.0,"17":104.0,"16":null,"36":null,"29":null,"18":null,"14":null,"34":null,"13":null},"scraping_date":{"8":1738800000000,"26":1738800000000,"30":1738800000000,"9":1738800000000,"7":1738800000000,"23":1738800000000,"0":1738800000000,"27":1738800000000,"11":1738800000000,"22":1738800000000,"19":1738800000000,"10":1738800000000,"20":1738800000000,"5":1738800000000,"28":1738800000000,"25":1738800000000,"31":1738800000000,"2":1738800000000,"12":1738800000000,"3":1738800000000,"4":1738800000000,"1":1738800000000,"33":1738800000000,"21":1738800000000,"24":1738800000000,"32":1738800000000,"6":1738800000000,"35":1738800000000,"15":1738800000000,"17":1738800000000,"16":1738800000000,"36":1738800000000,"29":1738800000000,"18":1738800000000,"14":1738800000000,"34":1738800000000,"13":1738800000000},"posted_date":{"8":1736380800000,"26":null,"30":1736380800000,"9":1737590400000,"7":1715472000000,"23":null,"0":1738195200000,"27":1707264000000,"11":1738281600000,"22":null,"19":null,"10":1736985600000,"20":null,"5":1737590400000,"28":1728432000000,"25":null,"31":null,"2":1731024000000,"12":1736985600000,"3":1736985600000,"4":1736985600000,"1":1738195200000,"33":1738713600000,"21":null,"24":null,"32":1738540800000,"6":1738368000000,"35":1737590400000,"15":1738627200000,"17":null,"16":null,"36":null,"29":null,"18":null,"14":1738540800000,"34":1738713600000,"13":1737590400000},"skills":{"8":["finance","continuous integration","testing","engineering","software","design","linux","docker","business","c++"],"26":["sentry","kubernetes","engineering","software engineering","data structures","go","design","api","complex system","mongodb","prometheus","blockchain","aws","docker","python","algorithms"],"30":["finance","kubernetes","continuous integration","testing","engineering","languages","software","design","linux","docker","business","python","c"],"9":["analytics","go","spring boot","database","html","javascript","react","c","software","linux","ai","python","r","engineering","testing","languages","design","docker","business","rotation","node.js","collaboration","c++"],"7":["testing","data structures","database","software","design","html","documentation",".net","javascript","sql","css","algorithms"],"23":["code quality","framework","testing","engineering","software","godaddy","code review","business","ai","python"],"0":["computer science","support","engineering","data structures","languages","software","design","software engineering","bash","ai","artificial intelligence","blockchain","shell","business","git","c","algorithms"],"27":["support","engineering","publishing","software","business"],"11":["computer science","framework","database","html","php","project management","workload","javascript","git","algorithms","data structures","software","api","aws","collaboration","support","testing","engineering","languages","data science","design","machine learning","documentation","azure","mysql","gcp","css","databases","sql","laravel"],"22":["git","libraries","query language","engineering","machine learning","software","design","deployment","reinforcement learning","ml","postgresql","neo4j","sql","aws","business","ai","python","algorithms"],"19":["support","testing","software","debugging","linux","documentation","encryption","python"],"10":["computer science","security","engineering","databases","software","design","release","flask","linux","data management","deployment","postgresql","collaboration","python","business","ubuntu"],"20":["grpc","security","schedule","spring","information management","git","algorithms","continuous integration","data structures","software","data modeling","system integration","testing","engineering","design","documentation","java","tower","business","rest api","junit","databases","google","collaboration"],"5":["analytics","snowflake","computer science","engineering","languages","azure","sql","mysql","business","python","apache spark"],"28":["engineering","databases","software","design","debugging","machine learning","flask","syntax","django","jupyter","artificial intelligence","business","ai","python"],"25":["finance","framework","security","project management","spring","code coverage","issue tracking","software","debugging","graphql","aws","ai","python","support","kubernetes","testing","engineering","design","java","docker","business","junit","collaboration"],"31":["support","testing","software","debugging","linux","documentation","encryption","ai","python"],"2":["analytics","snowflake","computer science","support","engineering","databases","software","design","azure","payments","devops","collaboration","ai","python","apache spark"],"12":["computer science","kubernetes","engineering","languages","software","design","release","html","databases","linux","docker","aws developer","mysql","aws","node.js","javascript","css","c"],"3":["computer science","hibernate","software engineering","databases","software","design","play","java","mysql","spring","ai","programming language"],"4":["git","support","framework","code review","go","engineering","github","software","medium","jira","java","rust","http","blockchain","ai","programming language"],"1":["framework","go","database","typescript","release","redis","javascript","git","cassandra","web servers","monitoring","software","support","testing","engineering","languages","design","slack","java","business","elasticsearch","databases","kafka"],"33":["computer science","security","software engineering","databases","software","design","languages","engineering","documentation","database design","aws","blockchain","data modeling","business"],"21":["finance","analytics","engineering","aerospace engineering","software","design","machine learning","languages","commerce","artificial intelligence","marketing","business","ai","collaboration"],"24":["framework","typescript","html","high availability","es6","spring","git","react","code quality","software","support","libraries","styled components","design","maven","java","business","css","gradle","hibernate","semantic html","sql"],"32":["analytics","support","database","software","design","data management","data analysis","http","xml","collaboration","ai","business"],"6":["computer science","support","ansible","rest api","languages","software","design","bash","databases","azure","documentation","chef","telecommunications","google","business","python"],"35":["support","rest api","engineering","deployment","metadata","javascript","business","ai"],"15":["computer science","analytics","framework","user interface","database","monitoring","continuous integration","software","linux","http","shell","programming language","python","collaboration","cloud foundry","devops","design","azure","concourse","business","databases","bash","platform as a service","google","sql"],"17":["computer science","go","software engineering","typescript","html","swift","javascript","software","ruby","shell","ai","net","python","r","data science","java","rust","code review","mobile","dart","php"],"16":["computer science","go","software engineering","typescript","html","swift","javascript","software","ruby","shell","ai","net","python","r","data science","java","rust","code review","mobile","dart","php"],"36":["analytics","security","high availability","terraform","deployment","scalability","monitoring","software","aws","server","ai","support","mode","testing","engineering","devops","design","azure","gcp","business","serverless","aws cloudformation","google","collaboration"],"29":["typescript","mobx","jira","confluence","git","react","web components","storybook","software","workflow","ai","engineering","jest","design","java","webpack","marketing","business","css","junit","redux","semantic html","invision","testing frameworks"],"18":["engineering","data science","artificial intelligence","data analysis","ai"],"14":["ranking","go","security","html","advertising","workload","javascript","code quality","search engines","ai","time constraint","testing","design","documentation","marketing","code review","business","wordpress","php"],"34":["security","spring boot","release","terraform","redis","scalability","cassandra","continuous integration","software","aws","memcached","python","kubernetes","design","azure","java","postgresql","mongodb","mysql","scripting language","node.js","business","elasticsearch","databases","google","php"],"13":["computer science","visualization","power bi","data science","databases","business intelligence","design","data visualization","oracle","data management","data analysis","sql","business","ai"]},"match_score":{"8":60.0,"26":56.2,"30":53.8,"9":52.2,"7":50.0,"23":50.0,"0":47.1,"27":40.0,"11":40.0,"22":38.9,"19":37.5,"10":37.5,"20":37.5,"5":36.4,"28":35.7,"25":34.8,"31":33.3,"2":33.3,"12":33.3,"3":33.3,"4":31.2,"1":30.4,"33":28.6,"21":28.6,"24":27.3,"32":25.0,"6":25.0,"35":25.0,"15":24.0,"17":23.8,"16":23.8,"36":20.8,"29":20.8,"18":20.0,"14":15.8,"34":15.4,"13":14.3},"missing_skills":{"8":"finance,continuous integration,software,linux,business","26":"sentry,kubernetes,go,api,complex system,mongodb,prometheus,blockchain,aws","30":"finance,kubernetes,continuous integration,languages,software,linux,business,c","9":"analytics,go,spring boot,database,html,javascript,c,software,linux,ai,r,languages,business,rotation,node.js","7":"database,software,html,documentation,.net,javascript,css","23":"code quality,software,godaddy,code review,business,ai","0":"computer science,support,languages,software,bash,ai,artificial intelligence,blockchain,shell,business,c","27":"support,publishing,software,business","11":"computer science,database,html,php,project management,workload,javascript,software,api,aws,support,languages,data science,machine learning,documentation,azure,gcp,css,databases,laravel","22":"libraries,query language,machine learning,software,deployment,reinforcement learning,ml,postgresql,neo4j,aws,business,ai","19":"support,software,debugging,linux,documentation,encryption","10":"computer science,security,databases,software,release,linux,data management,deployment,postgresql,business,ubuntu","20":"grpc,security,schedule,spring,information management,continuous integration,software,data modeling,system integration,documentation,java,tower,business,junit,databases,google","5":"analytics,snowflake,computer science,languages,azure,business,apache spark","28":"databases,software,debugging,machine learning,syntax,django,jupyter,artificial intelligence,business,ai","25":"finance,security,project management,spring,code coverage,issue tracking,software,debugging,graphql,aws,ai,support,kubernetes,java,business,junit","31":"support,software,debugging,linux,documentation,encryption,ai","2":"analytics,snowflake,computer science,support,databases,software,azure,payments,devops,ai,apache spark","12":"computer science,kubernetes,languages,software,release,html,databases,linux,aws developer,aws,node.js,javascript,css,c","3":"computer science,hibernate,databases,software,play,java,spring,ai,programming language","4":"support,code review,go,github,software,medium,jira,java,rust,http,blockchain,ai,programming language","1":"go,database,typescript,release,redis,javascript,cassandra,web servers,monitoring,software,support,languages,slack,java,business,elasticsearch,databases,kafka","33":"computer science,security,databases,software,languages,documentation,database design,aws,blockchain,data modeling,business","21":"finance,analytics,aerospace engineering,software,machine learning,languages,commerce,artificial intelligence,marketing,business,ai","24":"typescript,html,high availability,es6,spring,code quality,software,support,libraries,styled components,maven,java,business,css,gradle,hibernate,semantic html","32":"analytics,support,database,software,data management,data analysis,http,xml,ai,business","6":"computer science,support,ansible,languages,software,bash,databases,azure,documentation,chef,telecommunications,google,business","35":"support,deployment,metadata,javascript,business,ai","15":"computer science,analytics,user interface,database,monitoring,continuous integration,software,linux,http,shell,programming language,cloud foundry,devops,azure,concourse,business,databases,bash,platform as a service,google","17":"computer science,go,typescript,html,swift,javascript,software,ruby,shell,ai,net,r,data science,java,rust,code review,mobile,dart,php","16":"computer science,go,typescript,html,swift,javascript,software,ruby,shell,ai,net,r,data science,java,rust,code review,mobile,dart,php","36":"analytics,security,high availability,terraform,deployment,scalability,monitoring,software,aws,server,ai,support,mode,devops,azure,gcp,business,serverless,aws cloudformation,google","29":"typescript,mobx,jira,confluence,web components,storybook,software,workflow,ai,jest,java,webpack,marketing,business,css,junit,redux,semantic html,invision,testing frameworks","18":"data science,artificial intelligence,data analysis,ai","14":"ranking,go,security,html,advertising,workload,javascript,code quality,search engines,ai,time constraint,documentation,marketing,code review,business,wordpress,php","34":"security,spring boot,release,terraform,redis,scalability,cassandra,continuous integration,software,aws,memcached,kubernetes,azure,java,postgresql,mongodb,scripting language,node.js,business,elasticsearch,databases,google,php","13":"computer science,visualization,power bi,data science,databases,business intelligence,data visualization,oracle,data management,data analysis,business,ai"}}